{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "40a467be",
   "metadata": {},
   "source": [
    "___\n",
    "<img style=\"float: right; margin: 15px 15px 15px 15px;\" src=\"https://cdn.brandfetch.io/idjblR01Uf/w/400/h/400/theme/dark/icon.jpeg?c=1dxbfHSJFAPEGdCLU4o5B\" width=\"180px\" height=\"180px\" />\n",
    "\n",
    "# <font color= #5aafc1> **PROYECTO FINAL** </font>\n",
    "#### <font color= #2E9AFE> `Red Aeroportuaria Internacional`</font>\n",
    "- <Strong> Sofía Maldonado, Viviana Toledo, César Adrián Santos </Strong>\n",
    "- <Strong> Fecha </Strong>: 17/07/2025\n",
    "\n",
    "___"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 38,
   "id": "71f2ce0f",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Successfully Connected to Neo4j in neo5j database!\n",
      "Successfully Connected to GraphDataScience in neo5j database!\n"
     ]
    }
   ],
   "source": [
    "# Actualizar \n",
    "import importlib\n",
    "import queries \n",
    "importlib.reload(queries)\n",
    "from queries import DB_Queries\n",
    "\n",
    "# Establecer conexión\n",
    "db = DB_Queries('neo5j')"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "7ae2f8cd",
   "metadata": {},
   "source": [
    "# <font color= #5aafc1> **Desarrollo** </font>"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "9f3ed0a8",
   "metadata": {},
   "source": [
    "Añadir atributos de Continente a cada nodo:"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "a6433904",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "Empty DataFrame\n",
       "Columns: []\n",
       "Index: []"
      ]
     },
     "execution_count": 2,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query1 = \"\"\"MATCH (a:Airport) \n",
    "WHERE a.country = 'Burma'\n",
    "SET a.country = 'Myanmar'\n",
    "\"\"\"\n",
    "\n",
    "query2 = \"\"\"MATCH (a:Airport) \n",
    "WHERE a.country = 'Congo (Kinshasa)'\n",
    "SET a.country = 'Democratic Republic of the Congo'\n",
    "\"\"\"\n",
    "\n",
    "query3 = \"\"\"MATCH (a:Airport) \n",
    "WHERE a.country = 'Congo (Brazzaville)'\n",
    "SET a.country = 'Republic of the Congo'\n",
    "\"\"\"\n",
    "\n",
    "query4 = f\"\"\"LOAD CSV WITH HEADERS FROM 'https://raw.githubusercontent.com/ch0fas/MG_PROYECTO2/main/data/countries.csv' AS row\n",
    "MATCH (a:Airport)\n",
    "WHERE a.country = row.Country\n",
    "SET a.continent = row.Continent\n",
    "\"\"\"\n",
    "\n",
    "db.custom_query(query1)\n",
    "db.custom_query(query2)\n",
    "db.custom_query(query3)\n",
    "db.custom_query(query4)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "2a813342",
   "metadata": {},
   "source": [
    "Crear subgrafos:"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 39,
   "id": "cf72737b",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Successfully created Directed Subgraph with Airport nodes and TO relationships!\n",
      "Successfully created Reversed Subgraph with Airport nodes and TO relationships!\n",
      "Successfully created Undirected Subgraph with Airport nodes and TO relationships!\n"
     ]
    }
   ],
   "source": [
    "db.create_subgraph('Airport', 'TO', 'NATURAL', 'distance')\n",
    "db.create_subgraph('Airport', 'TO', 'REVERSE', 'distance')\n",
    "db.create_subgraph('Airport', 'TO', 'UNDIRECTED', 'distance')"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "7f1197b9",
   "metadata": {},
   "source": [
    "Centrality Algorithms:"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "aa3632ba",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Degree Attribute added Successfully!\n",
      "In_Degree Attribute added Successfully!\n",
      "Out_Degree Attribute added Successfully!\n",
      "Page Rank Attribute added Successfully!\n",
      "Betweenness Attribute added Successfully!\n",
      "Closeness Attribute added Successfully!\n"
     ]
    }
   ],
   "source": [
    "db.degrees('Airport')\n",
    "db.page_rank('Airport')\n",
    "db.betwenness('Airport')\n",
    "db.closeness('Airport')"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "6ffe27ca",
   "metadata": {},
   "source": [
    "#### <font color= #5aafc1> **4.2 Exploratory Data Analysis** </font>"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "fe946caa",
   "metadata": {},
   "source": [
    "Graph Schema:"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "14a2d519",
   "metadata": {},
   "source": [
    "Node Count:"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "5cf3e923",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Airports</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>3214</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   Airports\n",
       "0      3214"
      ]
     },
     "execution_count": 5,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# 4.2.2\n",
    "db.count_nodes('Airport')"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "f4156215",
   "metadata": {},
   "source": [
    "Node Attributes:"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "a8c7959a",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>nodeType</th>\n",
       "      <th>nodeLabels</th>\n",
       "      <th>propertyName</th>\n",
       "      <th>propertyTypes</th>\n",
       "      <th>mandatory</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>:`Airport`:`Europe`</td>\n",
       "      <td>[Airport, Europe]</td>\n",
       "      <td>Id</td>\n",
       "      <td>[Long]</td>\n",
       "      <td>True</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>:`Airport`:`Europe`</td>\n",
       "      <td>[Airport, Europe]</td>\n",
       "      <td>latitude</td>\n",
       "      <td>[Double]</td>\n",
       "      <td>True</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>:`Airport`:`Europe`</td>\n",
       "      <td>[Airport, Europe]</td>\n",
       "      <td>country</td>\n",
       "      <td>[String]</td>\n",
       "      <td>True</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>:`Airport`:`Europe`</td>\n",
       "      <td>[Airport, Europe]</td>\n",
       "      <td>longitude</td>\n",
       "      <td>[Double]</td>\n",
       "      <td>True</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>:`Airport`:`Europe`</td>\n",
       "      <td>[Airport, Europe]</td>\n",
       "      <td>Label</td>\n",
       "      <td>[String]</td>\n",
       "      <td>True</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>:`Airport`:`Europe`</td>\n",
       "      <td>[Airport, Europe]</td>\n",
       "      <td>continent</td>\n",
       "      <td>[String]</td>\n",
       "      <td>True</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>:`Airport`:`Europe`</td>\n",
       "      <td>[Airport, Europe]</td>\n",
       "      <td>Degree</td>\n",
       "      <td>[Double]</td>\n",
       "      <td>True</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>:`Airport`:`Europe`</td>\n",
       "      <td>[Airport, Europe]</td>\n",
       "      <td>Page_Rank</td>\n",
       "      <td>[Double]</td>\n",
       "      <td>True</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>:`Airport`:`Europe`</td>\n",
       "      <td>[Airport, Europe]</td>\n",
       "      <td>Betweenness</td>\n",
       "      <td>[Double]</td>\n",
       "      <td>True</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>:`Airport`:`Europe`</td>\n",
       "      <td>[Airport, Europe]</td>\n",
       "      <td>Closeness_Centrality</td>\n",
       "      <td>[Double]</td>\n",
       "      <td>True</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>:`Airport`:`Europe`</td>\n",
       "      <td>[Airport, Europe]</td>\n",
       "      <td>In_Degree</td>\n",
       "      <td>[Double]</td>\n",
       "      <td>True</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>:`Airport`:`Europe`</td>\n",
       "      <td>[Airport, Europe]</td>\n",
       "      <td>Out_Degree</td>\n",
       "      <td>[Double]</td>\n",
       "      <td>True</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>:`Airport`:`Europe`</td>\n",
       "      <td>[Airport, Europe]</td>\n",
       "      <td>Degree_Airport</td>\n",
       "      <td>[Double]</td>\n",
       "      <td>True</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>:`Airport`:`Europe`</td>\n",
       "      <td>[Airport, Europe]</td>\n",
       "      <td>In_Degree_Airport</td>\n",
       "      <td>[Double]</td>\n",
       "      <td>True</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>:`Airport`:`Europe`</td>\n",
       "      <td>[Airport, Europe]</td>\n",
       "      <td>Out_Degree_Airport</td>\n",
       "      <td>[Double]</td>\n",
       "      <td>True</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>:`Airport`:`Europe`</td>\n",
       "      <td>[Airport, Europe]</td>\n",
       "      <td>Page_Rank_Airport</td>\n",
       "      <td>[Double]</td>\n",
       "      <td>True</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>:`Airport`:`Europe`</td>\n",
       "      <td>[Airport, Europe]</td>\n",
       "      <td>Betweenness_Airport</td>\n",
       "      <td>[Double]</td>\n",
       "      <td>True</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>:`Airport`</td>\n",
       "      <td>[Airport]</td>\n",
       "      <td>Id</td>\n",
       "      <td>[Long]</td>\n",
       "      <td>True</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>:`Airport`</td>\n",
       "      <td>[Airport]</td>\n",
       "      <td>latitude</td>\n",
       "      <td>[Double]</td>\n",
       "      <td>True</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>:`Airport`</td>\n",
       "      <td>[Airport]</td>\n",
       "      <td>country</td>\n",
       "      <td>[String]</td>\n",
       "      <td>True</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>20</th>\n",
       "      <td>:`Airport`</td>\n",
       "      <td>[Airport]</td>\n",
       "      <td>longitude</td>\n",
       "      <td>[Double]</td>\n",
       "      <td>True</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>21</th>\n",
       "      <td>:`Airport`</td>\n",
       "      <td>[Airport]</td>\n",
       "      <td>Label</td>\n",
       "      <td>[String]</td>\n",
       "      <td>True</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>22</th>\n",
       "      <td>:`Airport`</td>\n",
       "      <td>[Airport]</td>\n",
       "      <td>continent</td>\n",
       "      <td>[String]</td>\n",
       "      <td>True</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>23</th>\n",
       "      <td>:`Airport`</td>\n",
       "      <td>[Airport]</td>\n",
       "      <td>Degree</td>\n",
       "      <td>[Double]</td>\n",
       "      <td>True</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>24</th>\n",
       "      <td>:`Airport`</td>\n",
       "      <td>[Airport]</td>\n",
       "      <td>Page_Rank</td>\n",
       "      <td>[Double]</td>\n",
       "      <td>True</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>25</th>\n",
       "      <td>:`Airport`</td>\n",
       "      <td>[Airport]</td>\n",
       "      <td>Betweenness</td>\n",
       "      <td>[Double]</td>\n",
       "      <td>True</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>26</th>\n",
       "      <td>:`Airport`</td>\n",
       "      <td>[Airport]</td>\n",
       "      <td>Closeness_Centrality</td>\n",
       "      <td>[Double]</td>\n",
       "      <td>True</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>27</th>\n",
       "      <td>:`Airport`</td>\n",
       "      <td>[Airport]</td>\n",
       "      <td>In_Degree</td>\n",
       "      <td>[Double]</td>\n",
       "      <td>True</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>28</th>\n",
       "      <td>:`Airport`</td>\n",
       "      <td>[Airport]</td>\n",
       "      <td>Out_Degree</td>\n",
       "      <td>[Double]</td>\n",
       "      <td>True</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>29</th>\n",
       "      <td>:`Airport`</td>\n",
       "      <td>[Airport]</td>\n",
       "      <td>Degree_Airport</td>\n",
       "      <td>[Double]</td>\n",
       "      <td>True</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>30</th>\n",
       "      <td>:`Airport`</td>\n",
       "      <td>[Airport]</td>\n",
       "      <td>In_Degree_Airport</td>\n",
       "      <td>[Double]</td>\n",
       "      <td>True</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>31</th>\n",
       "      <td>:`Airport`</td>\n",
       "      <td>[Airport]</td>\n",
       "      <td>Out_Degree_Airport</td>\n",
       "      <td>[Double]</td>\n",
       "      <td>True</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>32</th>\n",
       "      <td>:`Airport`</td>\n",
       "      <td>[Airport]</td>\n",
       "      <td>Page_Rank_Airport</td>\n",
       "      <td>[Double]</td>\n",
       "      <td>True</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>33</th>\n",
       "      <td>:`Airport`</td>\n",
       "      <td>[Airport]</td>\n",
       "      <td>Betweenness_Airport</td>\n",
       "      <td>[Double]</td>\n",
       "      <td>True</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>34</th>\n",
       "      <td>:`Airport`:`Asia`</td>\n",
       "      <td>[Airport, Asia]</td>\n",
       "      <td>Id</td>\n",
       "      <td>[Long]</td>\n",
       "      <td>True</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>35</th>\n",
       "      <td>:`Airport`:`Asia`</td>\n",
       "      <td>[Airport, Asia]</td>\n",
       "      <td>latitude</td>\n",
       "      <td>[Double]</td>\n",
       "      <td>True</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>36</th>\n",
       "      <td>:`Airport`:`Asia`</td>\n",
       "      <td>[Airport, Asia]</td>\n",
       "      <td>country</td>\n",
       "      <td>[String]</td>\n",
       "      <td>True</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>37</th>\n",
       "      <td>:`Airport`:`Asia`</td>\n",
       "      <td>[Airport, Asia]</td>\n",
       "      <td>longitude</td>\n",
       "      <td>[Double]</td>\n",
       "      <td>True</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>38</th>\n",
       "      <td>:`Airport`:`Asia`</td>\n",
       "      <td>[Airport, Asia]</td>\n",
       "      <td>Label</td>\n",
       "      <td>[String]</td>\n",
       "      <td>True</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>39</th>\n",
       "      <td>:`Airport`:`Asia`</td>\n",
       "      <td>[Airport, Asia]</td>\n",
       "      <td>continent</td>\n",
       "      <td>[String]</td>\n",
       "      <td>True</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>40</th>\n",
       "      <td>:`Airport`:`Asia`</td>\n",
       "      <td>[Airport, Asia]</td>\n",
       "      <td>Degree</td>\n",
       "      <td>[Double]</td>\n",
       "      <td>True</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>41</th>\n",
       "      <td>:`Airport`:`Asia`</td>\n",
       "      <td>[Airport, Asia]</td>\n",
       "      <td>Page_Rank</td>\n",
       "      <td>[Double]</td>\n",
       "      <td>True</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>42</th>\n",
       "      <td>:`Airport`:`Asia`</td>\n",
       "      <td>[Airport, Asia]</td>\n",
       "      <td>Betweenness</td>\n",
       "      <td>[Double]</td>\n",
       "      <td>True</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>43</th>\n",
       "      <td>:`Airport`:`Asia`</td>\n",
       "      <td>[Airport, Asia]</td>\n",
       "      <td>Closeness_Centrality</td>\n",
       "      <td>[Double]</td>\n",
       "      <td>True</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>44</th>\n",
       "      <td>:`Airport`:`Asia`</td>\n",
       "      <td>[Airport, Asia]</td>\n",
       "      <td>In_Degree</td>\n",
       "      <td>[Double]</td>\n",
       "      <td>True</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>45</th>\n",
       "      <td>:`Airport`:`Asia`</td>\n",
       "      <td>[Airport, Asia]</td>\n",
       "      <td>Out_Degree</td>\n",
       "      <td>[Double]</td>\n",
       "      <td>True</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>46</th>\n",
       "      <td>:`Airport`:`Asia`</td>\n",
       "      <td>[Airport, Asia]</td>\n",
       "      <td>Page_Rank_Asia</td>\n",
       "      <td>[Double]</td>\n",
       "      <td>True</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>47</th>\n",
       "      <td>:`Airport`:`Asia`</td>\n",
       "      <td>[Airport, Asia]</td>\n",
       "      <td>Closeness_Centrality_Asia</td>\n",
       "      <td>[Double]</td>\n",
       "      <td>True</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>48</th>\n",
       "      <td>:`Airport`:`Asia`</td>\n",
       "      <td>[Airport, Asia]</td>\n",
       "      <td>Betweenness_Asia</td>\n",
       "      <td>[Double]</td>\n",
       "      <td>True</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>49</th>\n",
       "      <td>:`Airport`:`Asia`</td>\n",
       "      <td>[Airport, Asia]</td>\n",
       "      <td>Louvain</td>\n",
       "      <td>[Long]</td>\n",
       "      <td>True</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>50</th>\n",
       "      <td>:`Airport`:`Asia`</td>\n",
       "      <td>[Airport, Asia]</td>\n",
       "      <td>Label_Propagation</td>\n",
       "      <td>[Long]</td>\n",
       "      <td>True</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>51</th>\n",
       "      <td>:`Airport`:`Asia`</td>\n",
       "      <td>[Airport, Asia]</td>\n",
       "      <td>Triangles</td>\n",
       "      <td>[Long]</td>\n",
       "      <td>True</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>52</th>\n",
       "      <td>:`Airport`:`Asia`</td>\n",
       "      <td>[Airport, Asia]</td>\n",
       "      <td>localClusteringCoefficient</td>\n",
       "      <td>[Double]</td>\n",
       "      <td>True</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>53</th>\n",
       "      <td>:`Airport`:`Asia`</td>\n",
       "      <td>[Airport, Asia]</td>\n",
       "      <td>Community_SCC</td>\n",
       "      <td>[Long]</td>\n",
       "      <td>True</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>54</th>\n",
       "      <td>:`Airport`:`Asia`</td>\n",
       "      <td>[Airport, Asia]</td>\n",
       "      <td>Community_WCC</td>\n",
       "      <td>[Long]</td>\n",
       "      <td>True</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>55</th>\n",
       "      <td>:`Airport`:`Asia`</td>\n",
       "      <td>[Airport, Asia]</td>\n",
       "      <td>Degree_Airport</td>\n",
       "      <td>[Double]</td>\n",
       "      <td>True</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>56</th>\n",
       "      <td>:`Airport`:`Asia`</td>\n",
       "      <td>[Airport, Asia]</td>\n",
       "      <td>In_Degree_Airport</td>\n",
       "      <td>[Double]</td>\n",
       "      <td>True</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>57</th>\n",
       "      <td>:`Airport`:`Asia`</td>\n",
       "      <td>[Airport, Asia]</td>\n",
       "      <td>Out_Degree_Airport</td>\n",
       "      <td>[Double]</td>\n",
       "      <td>True</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>58</th>\n",
       "      <td>:`Airport`:`Asia`</td>\n",
       "      <td>[Airport, Asia]</td>\n",
       "      <td>Page_Rank_Airport</td>\n",
       "      <td>[Double]</td>\n",
       "      <td>True</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>59</th>\n",
       "      <td>:`Airport`:`Asia`</td>\n",
       "      <td>[Airport, Asia]</td>\n",
       "      <td>Betweenness_Airport</td>\n",
       "      <td>[Double]</td>\n",
       "      <td>True</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "               nodeType         nodeLabels                propertyName  \\\n",
       "0   :`Airport`:`Europe`  [Airport, Europe]                          Id   \n",
       "1   :`Airport`:`Europe`  [Airport, Europe]                    latitude   \n",
       "2   :`Airport`:`Europe`  [Airport, Europe]                     country   \n",
       "3   :`Airport`:`Europe`  [Airport, Europe]                   longitude   \n",
       "4   :`Airport`:`Europe`  [Airport, Europe]                       Label   \n",
       "5   :`Airport`:`Europe`  [Airport, Europe]                   continent   \n",
       "6   :`Airport`:`Europe`  [Airport, Europe]                      Degree   \n",
       "7   :`Airport`:`Europe`  [Airport, Europe]                   Page_Rank   \n",
       "8   :`Airport`:`Europe`  [Airport, Europe]                 Betweenness   \n",
       "9   :`Airport`:`Europe`  [Airport, Europe]        Closeness_Centrality   \n",
       "10  :`Airport`:`Europe`  [Airport, Europe]                   In_Degree   \n",
       "11  :`Airport`:`Europe`  [Airport, Europe]                  Out_Degree   \n",
       "12  :`Airport`:`Europe`  [Airport, Europe]              Degree_Airport   \n",
       "13  :`Airport`:`Europe`  [Airport, Europe]           In_Degree_Airport   \n",
       "14  :`Airport`:`Europe`  [Airport, Europe]          Out_Degree_Airport   \n",
       "15  :`Airport`:`Europe`  [Airport, Europe]           Page_Rank_Airport   \n",
       "16  :`Airport`:`Europe`  [Airport, Europe]         Betweenness_Airport   \n",
       "17           :`Airport`          [Airport]                          Id   \n",
       "18           :`Airport`          [Airport]                    latitude   \n",
       "19           :`Airport`          [Airport]                     country   \n",
       "20           :`Airport`          [Airport]                   longitude   \n",
       "21           :`Airport`          [Airport]                       Label   \n",
       "22           :`Airport`          [Airport]                   continent   \n",
       "23           :`Airport`          [Airport]                      Degree   \n",
       "24           :`Airport`          [Airport]                   Page_Rank   \n",
       "25           :`Airport`          [Airport]                 Betweenness   \n",
       "26           :`Airport`          [Airport]        Closeness_Centrality   \n",
       "27           :`Airport`          [Airport]                   In_Degree   \n",
       "28           :`Airport`          [Airport]                  Out_Degree   \n",
       "29           :`Airport`          [Airport]              Degree_Airport   \n",
       "30           :`Airport`          [Airport]           In_Degree_Airport   \n",
       "31           :`Airport`          [Airport]          Out_Degree_Airport   \n",
       "32           :`Airport`          [Airport]           Page_Rank_Airport   \n",
       "33           :`Airport`          [Airport]         Betweenness_Airport   \n",
       "34    :`Airport`:`Asia`    [Airport, Asia]                          Id   \n",
       "35    :`Airport`:`Asia`    [Airport, Asia]                    latitude   \n",
       "36    :`Airport`:`Asia`    [Airport, Asia]                     country   \n",
       "37    :`Airport`:`Asia`    [Airport, Asia]                   longitude   \n",
       "38    :`Airport`:`Asia`    [Airport, Asia]                       Label   \n",
       "39    :`Airport`:`Asia`    [Airport, Asia]                   continent   \n",
       "40    :`Airport`:`Asia`    [Airport, Asia]                      Degree   \n",
       "41    :`Airport`:`Asia`    [Airport, Asia]                   Page_Rank   \n",
       "42    :`Airport`:`Asia`    [Airport, Asia]                 Betweenness   \n",
       "43    :`Airport`:`Asia`    [Airport, Asia]        Closeness_Centrality   \n",
       "44    :`Airport`:`Asia`    [Airport, Asia]                   In_Degree   \n",
       "45    :`Airport`:`Asia`    [Airport, Asia]                  Out_Degree   \n",
       "46    :`Airport`:`Asia`    [Airport, Asia]              Page_Rank_Asia   \n",
       "47    :`Airport`:`Asia`    [Airport, Asia]   Closeness_Centrality_Asia   \n",
       "48    :`Airport`:`Asia`    [Airport, Asia]            Betweenness_Asia   \n",
       "49    :`Airport`:`Asia`    [Airport, Asia]                     Louvain   \n",
       "50    :`Airport`:`Asia`    [Airport, Asia]           Label_Propagation   \n",
       "51    :`Airport`:`Asia`    [Airport, Asia]                   Triangles   \n",
       "52    :`Airport`:`Asia`    [Airport, Asia]  localClusteringCoefficient   \n",
       "53    :`Airport`:`Asia`    [Airport, Asia]               Community_SCC   \n",
       "54    :`Airport`:`Asia`    [Airport, Asia]               Community_WCC   \n",
       "55    :`Airport`:`Asia`    [Airport, Asia]              Degree_Airport   \n",
       "56    :`Airport`:`Asia`    [Airport, Asia]           In_Degree_Airport   \n",
       "57    :`Airport`:`Asia`    [Airport, Asia]          Out_Degree_Airport   \n",
       "58    :`Airport`:`Asia`    [Airport, Asia]           Page_Rank_Airport   \n",
       "59    :`Airport`:`Asia`    [Airport, Asia]         Betweenness_Airport   \n",
       "\n",
       "   propertyTypes  mandatory  \n",
       "0         [Long]       True  \n",
       "1       [Double]       True  \n",
       "2       [String]       True  \n",
       "3       [Double]       True  \n",
       "4       [String]       True  \n",
       "5       [String]       True  \n",
       "6       [Double]       True  \n",
       "7       [Double]       True  \n",
       "8       [Double]       True  \n",
       "9       [Double]       True  \n",
       "10      [Double]       True  \n",
       "11      [Double]       True  \n",
       "12      [Double]       True  \n",
       "13      [Double]       True  \n",
       "14      [Double]       True  \n",
       "15      [Double]       True  \n",
       "16      [Double]       True  \n",
       "17        [Long]       True  \n",
       "18      [Double]       True  \n",
       "19      [String]       True  \n",
       "20      [Double]       True  \n",
       "21      [String]       True  \n",
       "22      [String]       True  \n",
       "23      [Double]       True  \n",
       "24      [Double]       True  \n",
       "25      [Double]       True  \n",
       "26      [Double]       True  \n",
       "27      [Double]       True  \n",
       "28      [Double]       True  \n",
       "29      [Double]       True  \n",
       "30      [Double]       True  \n",
       "31      [Double]       True  \n",
       "32      [Double]       True  \n",
       "33      [Double]       True  \n",
       "34        [Long]       True  \n",
       "35      [Double]       True  \n",
       "36      [String]       True  \n",
       "37      [Double]       True  \n",
       "38      [String]       True  \n",
       "39      [String]       True  \n",
       "40      [Double]       True  \n",
       "41      [Double]       True  \n",
       "42      [Double]       True  \n",
       "43      [Double]       True  \n",
       "44      [Double]       True  \n",
       "45      [Double]       True  \n",
       "46      [Double]       True  \n",
       "47      [Double]       True  \n",
       "48      [Double]       True  \n",
       "49        [Long]       True  \n",
       "50        [Long]       True  \n",
       "51        [Long]       True  \n",
       "52      [Double]       True  \n",
       "53        [Long]       True  \n",
       "54        [Long]       True  \n",
       "55      [Double]       True  \n",
       "56      [Double]       True  \n",
       "57      [Double]       True  \n",
       "58      [Double]       True  \n",
       "59      [Double]       True  "
      ]
     },
     "execution_count": 6,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "db.node_attributes()"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "95c877b0",
   "metadata": {},
   "source": [
    "Relationship Count:"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "aea4d88d",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>TO_Count</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>36907</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   TO_Count\n",
       "0     36907"
      ]
     },
     "execution_count": 7,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "db.count_relationships('TO')"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "291670f9",
   "metadata": {},
   "source": [
    "Relationship Attributes:"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "id": "b4e0fdcf",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>relType</th>\n",
       "      <th>propertyName</th>\n",
       "      <th>propertyTypes</th>\n",
       "      <th>mandatory</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>:`TO`</td>\n",
       "      <td>distance</td>\n",
       "      <td>[Double]</td>\n",
       "      <td>True</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>:`PATH_Bogota_Directed`</td>\n",
       "      <td>totalCost</td>\n",
       "      <td>[Double]</td>\n",
       "      <td>True</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>:`PATH_Bogota_Directed`</td>\n",
       "      <td>nodeIds</td>\n",
       "      <td>[LongArray]</td>\n",
       "      <td>True</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>:`PATH_Bogota_Directed`</td>\n",
       "      <td>costs</td>\n",
       "      <td>[DoubleArray]</td>\n",
       "      <td>True</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>:`PATH_Bogota_Undirected`</td>\n",
       "      <td>totalCost</td>\n",
       "      <td>[Double]</td>\n",
       "      <td>True</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>:`PATH_Bogota_Undirected`</td>\n",
       "      <td>nodeIds</td>\n",
       "      <td>[LongArray]</td>\n",
       "      <td>True</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>:`PATH_Bogota_Undirected`</td>\n",
       "      <td>costs</td>\n",
       "      <td>[DoubleArray]</td>\n",
       "      <td>True</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                     relType propertyName  propertyTypes  mandatory\n",
       "0                      :`TO`     distance       [Double]       True\n",
       "1    :`PATH_Bogota_Directed`    totalCost       [Double]       True\n",
       "2    :`PATH_Bogota_Directed`      nodeIds    [LongArray]       True\n",
       "3    :`PATH_Bogota_Directed`        costs  [DoubleArray]       True\n",
       "4  :`PATH_Bogota_Undirected`    totalCost       [Double]       True\n",
       "5  :`PATH_Bogota_Undirected`      nodeIds    [LongArray]       True\n",
       "6  :`PATH_Bogota_Undirected`        costs  [DoubleArray]       True"
      ]
     },
     "execution_count": 8,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "db.rel_attributes()"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "aa9b08d3",
   "metadata": {},
   "source": [
    "#### <font color= #5aafc1> **4.3 Visualización en Gephi** </font>"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "id": "806ea62a",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "Empty DataFrame\n",
       "Columns: []\n",
       "Index: []"
      ]
     },
     "execution_count": 9,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Le voy a agregar atributos de latitud y longitud en integer para poder meterlo a Gephi \n",
    "\n",
    "query4_3 = f\"\"\"\n",
    "    MATCH (n)\n",
    "    SET n.latInt = toInteger(n.latitude)\n",
    "    SET n.longInt = toInteger(n.longitude)\n",
    "\"\"\"\n",
    "\n",
    "db.custom_query(query4_3)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "a7f0215d",
   "metadata": {},
   "source": [
    "#### <font color= #5aafc1> **4.5 Elige el nodo de la pregunta 4.4 como origen y uno de los posibles aeropuertos alcanzables de la misma pregunta como destino, muestra la ruta completa del origen al destino en un mapa.** </font>"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "id": "3606cb1b",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>a.Label</th>\n",
       "      <th>Dist1</th>\n",
       "      <th>b.Label</th>\n",
       "      <th>Dist2</th>\n",
       "      <th>c.Label</th>\n",
       "      <th>Dist3</th>\n",
       "      <th>m.Label</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Villahermosa</td>\n",
       "      <td>1358.755582</td>\n",
       "      <td>Houston</td>\n",
       "      <td>10681.305092</td>\n",
       "      <td>Tokyo</td>\n",
       "      <td>5915.459645</td>\n",
       "      <td>Delhi</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Villahermosa</td>\n",
       "      <td>1358.755582</td>\n",
       "      <td>Houston</td>\n",
       "      <td>11358.558584</td>\n",
       "      <td>Seoul</td>\n",
       "      <td>4657.687448</td>\n",
       "      <td>Delhi</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Villahermosa</td>\n",
       "      <td>1358.755582</td>\n",
       "      <td>Houston</td>\n",
       "      <td>12947.031367</td>\n",
       "      <td>Doha</td>\n",
       "      <td>2552.069255</td>\n",
       "      <td>Delhi</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Villahermosa</td>\n",
       "      <td>1358.755582</td>\n",
       "      <td>Houston</td>\n",
       "      <td>11569.256010</td>\n",
       "      <td>Beijing</td>\n",
       "      <td>3813.207294</td>\n",
       "      <td>Delhi</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Villahermosa</td>\n",
       "      <td>1358.755582</td>\n",
       "      <td>Houston</td>\n",
       "      <td>13139.523542</td>\n",
       "      <td>Dubai</td>\n",
       "      <td>2186.045810</td>\n",
       "      <td>Delhi</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>Villahermosa</td>\n",
       "      <td>678.579085</td>\n",
       "      <td>Mexico City</td>\n",
       "      <td>9209.229377</td>\n",
       "      <td>Paris</td>\n",
       "      <td>6572.730383</td>\n",
       "      <td>Delhi</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>Villahermosa</td>\n",
       "      <td>678.579085</td>\n",
       "      <td>Mexico City</td>\n",
       "      <td>9855.892994</td>\n",
       "      <td>Munich</td>\n",
       "      <td>5906.062233</td>\n",
       "      <td>Delhi</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>Villahermosa</td>\n",
       "      <td>678.579085</td>\n",
       "      <td>Mexico City</td>\n",
       "      <td>9562.676617</td>\n",
       "      <td>Frankfurt</td>\n",
       "      <td>6127.480196</td>\n",
       "      <td>Delhi</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>Villahermosa</td>\n",
       "      <td>678.579085</td>\n",
       "      <td>Mexico City</td>\n",
       "      <td>8913.836258</td>\n",
       "      <td>London</td>\n",
       "      <td>6738.831316</td>\n",
       "      <td>Delhi</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>Villahermosa</td>\n",
       "      <td>678.579085</td>\n",
       "      <td>Mexico City</td>\n",
       "      <td>9216.602463</td>\n",
       "      <td>Amsterdam</td>\n",
       "      <td>6370.585848</td>\n",
       "      <td>Delhi</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "        a.Label        Dist1      b.Label         Dist2    c.Label  \\\n",
       "0  Villahermosa  1358.755582      Houston  10681.305092      Tokyo   \n",
       "1  Villahermosa  1358.755582      Houston  11358.558584      Seoul   \n",
       "2  Villahermosa  1358.755582      Houston  12947.031367       Doha   \n",
       "3  Villahermosa  1358.755582      Houston  11569.256010    Beijing   \n",
       "4  Villahermosa  1358.755582      Houston  13139.523542      Dubai   \n",
       "5  Villahermosa   678.579085  Mexico City   9209.229377      Paris   \n",
       "6  Villahermosa   678.579085  Mexico City   9855.892994     Munich   \n",
       "7  Villahermosa   678.579085  Mexico City   9562.676617  Frankfurt   \n",
       "8  Villahermosa   678.579085  Mexico City   8913.836258     London   \n",
       "9  Villahermosa   678.579085  Mexico City   9216.602463  Amsterdam   \n",
       "\n",
       "         Dist3 m.Label  \n",
       "0  5915.459645   Delhi  \n",
       "1  4657.687448   Delhi  \n",
       "2  2552.069255   Delhi  \n",
       "3  3813.207294   Delhi  \n",
       "4  2186.045810   Delhi  \n",
       "5  6572.730383   Delhi  \n",
       "6  5906.062233   Delhi  \n",
       "7  6127.480196   Delhi  \n",
       "8  6738.831316   Delhi  \n",
       "9  6370.585848   Delhi  "
      ]
     },
     "execution_count": 10,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query4_5 = f\"\"\" \n",
    "    MATCH(a:Airport {{Label:'Villahermosa'}})-[r1]->(b)-[r2]->(c)-[r3]->(m:Airport {{Label:'Delhi'}})\n",
    "    WHERE r3.distance IS NOT NULL\n",
    "    RETURN a.Label,r1.distance AS Dist1,b.Label,r2.distance AS Dist2,c.Label,r3.distance AS Dist3,m.Label\n",
    "    ORDER BY Dist1+Dist2+Dist3 DESC\n",
    "    LIMIT 10;\n",
    "\"\"\"\n",
    "\n",
    "db.custom_query(query4_5)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "a8e3aab3",
   "metadata": {},
   "source": [
    "#### <font color= #5aafc1> **4.6 Elige un país, que no sea México, analiza el # de aeropuertos que tiene, cuál de ellos es el más importante tomando al menos dos medidas de centralidad para avalar tu respuesta.** </font>"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "62d513eb",
   "metadata": {},
   "source": [
    "#### <font color= #5aafc1> **4.7 Muestra la mejor ruta entre el aeropuerto de la pregunta 4.6 y el aeropuerto de la CDMX** </font>"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "9160d24e",
   "metadata": {},
   "source": [
    "#### <font color= #5aafc1> **4.8. Imagina que vives en el país que elegiste en el punto 4.7 (Colombia) y tienes la posibilidad de viajar a cualquier parte del mundo desde su aeropuerto más importante.** </font>"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "30329352",
   "metadata": {},
   "source": [
    "Primero encontraremos el aeropuerto más importante de Colombia en base a la medida de centralidad _Page Rank_, que evalúa las conexiones que salen del nodo y les asigna una relevancia."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "id": "a230f010",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Airport</th>\n",
       "      <th>Country</th>\n",
       "      <th>Page_Rank</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Bogota</td>\n",
       "      <td>Colombia</td>\n",
       "      <td>9.420864</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "  Airport   Country  Page_Rank\n",
       "0  Bogota  Colombia   9.420864"
      ]
     },
     "execution_count": 11,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query1 = \"\"\"MATCH (a:Airport)\n",
    "WHERE a.country = 'Colombia'\n",
    "RETURN a.Label AS Airport, a.country AS Country, a.Page_Rank AS Page_Rank\n",
    "ORDER BY Page_Rank DESC\n",
    "LIMIT 1\n",
    "\"\"\"\n",
    "\n",
    "db.custom_query(query1)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "cfb97aa3",
   "metadata": {},
   "source": [
    "El aeropuerto más importante de Colombia es el de Bogotá, que se ubica en la capital."
   ]
  },
  {
   "cell_type": "markdown",
   "id": "1f6457d8",
   "metadata": {},
   "source": [
    "#### <font color= #5aafc1> &nbsp; &nbsp; **4.8.1. ¿Cuántos kilómetros se requieren para visitar las 7 maravillas del mundo?** </font>\n",
    "#### <font color= #5aafc1> &nbsp; &nbsp; **4.8.2. ¿Cuál sería la mejor ruta para visitarlas todas, en qué orden y por qué?** </font>"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "f8a9bcf3",
   "metadata": {},
   "source": [
    "Decidimos trabajar con las siguientes 7 maravillas del mundo modernas:\n",
    "\n",
    "- Giza Pyramids: Cairo\n",
    "- Great Wall of China: Beijing\n",
    "- Colosseum: Rome\n",
    "- Chichen Itzá: Mérida\n",
    "- Machu Picchu: Cuzco\n",
    "- Taj Mahal: Lucknow\n",
    "- Christ the Redeemer: Rio de Janeiro"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "6282fd3a",
   "metadata": {},
   "source": [
    "Para dar respuesta a las preguntas, se analizaron todas las combinaciones posibles desde Bogotá hacia los destinos mencionados. Entonces, a partir de Bogotá, la mejor ruta para recorrer las 7 maravillas del mundo moderno es:"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "id": "740fab89",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Order</th>\n",
       "      <th>Distance</th>\n",
       "      <th>Full_route</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>(Bogota, Merida, Cuzco, Rio De Janeiro, Rome, Cairo, Lucknow, Beijing)</td>\n",
       "      <td>29588.070071</td>\n",
       "      <td>[Bogota, Caracas, Merida, Merida, Caracas, Lima, Cuzco, Cuzco, La Paz, Santa Cruz, Sao Paulo, Rio De Janeiro, Rio De Janeiro, Belo Horizonte, Fortaleza, Praia, Santiago Island, Casablanca, Rome, Rome, Cairo, Cairo, Amman, Delhi, Lucknow, Lucknow, Delhi, Kathmandu, Lhasa, Yinchuan, Dongsheng, Beijing, Beijing]</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                                                    Order  \\\n",
       "0  (Bogota, Merida, Cuzco, Rio De Janeiro, Rome, Cairo, Lucknow, Beijing)   \n",
       "\n",
       "       Distance  \\\n",
       "0  29588.070071   \n",
       "\n",
       "                                                                                                                                                                                                                                                                                                               Full_route  \n",
       "0  [Bogota, Caracas, Merida, Merida, Caracas, Lima, Cuzco, Cuzco, La Paz, Santa Cruz, Sao Paulo, Rio De Janeiro, Rio De Janeiro, Belo Horizonte, Fortaleza, Praia, Santiago Island, Casablanca, Rome, Rome, Cairo, Cairo, Amman, Delhi, Lucknow, Lucknow, Delhi, Kathmandu, Lhasa, Yinchuan, Dongsheng, Beijing, Beijing]  "
      ]
     },
     "execution_count": 12,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "db.seven_wonders_best_route('Airport','Label','Bogota','distance')"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "00328443",
   "metadata": {},
   "source": [
    "Esto requiere alrededor de 29,588 km."
   ]
  },
  {
   "cell_type": "markdown",
   "id": "7e139c5b",
   "metadata": {},
   "source": [
    "#### <font color= #5aafc1> &nbsp; &nbsp; **4.8.3. Aeropuertos visitables desde el Aeropuerto más importante de Colombia en menos de 20,000km** </font>"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "0f239750",
   "metadata": {},
   "source": [
    "Crearemos un atributo que nos permita evaluar todas las rutas posibles desde Bogotá:"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "id": "e4486fe5",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Directed Delta Pathing for Bogota already exists. Creation skipped.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Source</th>\n",
       "      <th>Bridges</th>\n",
       "      <th>Partial_Costs</th>\n",
       "      <th>Total_Cost</th>\n",
       "      <th>Target</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Bogota</td>\n",
       "      <td>[Goroka, Port Moresby, Panama City, Nandi, Bogota, Los Angeles]</td>\n",
       "      <td>[0.0, 755.8972047746067, 5606.6853979173375, 14508.500729366064, 17901.63346808019, 18326.70207030612]</td>\n",
       "      <td>18326.702070</td>\n",
       "      <td>Goroka</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Bogota</td>\n",
       "      <td>[Madang, Port Moresby, Panama City, Nandi, Bogota, Los Angeles]</td>\n",
       "      <td>[0.0, 755.8972047746067, 5606.6853979173375, 14508.500729366064, 17901.63346808019, 18398.968325213587]</td>\n",
       "      <td>18398.968325</td>\n",
       "      <td>Madang</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Bogota</td>\n",
       "      <td>[Mount Hagen, Port Moresby, Panama City, Nandi, Bogota, Los Angeles]</td>\n",
       "      <td>[0.0, 755.8972047746067, 5606.6853979173375, 14508.500729366064, 17901.63346808019, 18417.507717458266]</td>\n",
       "      <td>18417.507717</td>\n",
       "      <td>Mount Hagen</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   Source  \\\n",
       "0  Bogota   \n",
       "1  Bogota   \n",
       "2  Bogota   \n",
       "\n",
       "                                                                Bridges  \\\n",
       "0       [Goroka, Port Moresby, Panama City, Nandi, Bogota, Los Angeles]   \n",
       "1       [Madang, Port Moresby, Panama City, Nandi, Bogota, Los Angeles]   \n",
       "2  [Mount Hagen, Port Moresby, Panama City, Nandi, Bogota, Los Angeles]   \n",
       "\n",
       "                                                                                             Partial_Costs  \\\n",
       "0   [0.0, 755.8972047746067, 5606.6853979173375, 14508.500729366064, 17901.63346808019, 18326.70207030612]   \n",
       "1  [0.0, 755.8972047746067, 5606.6853979173375, 14508.500729366064, 17901.63346808019, 18398.968325213587]   \n",
       "2  [0.0, 755.8972047746067, 5606.6853979173375, 14508.500729366064, 17901.63346808019, 18417.507717458266]   \n",
       "\n",
       "     Total_Cost       Target  \n",
       "0  18326.702070       Goroka  \n",
       "1  18398.968325       Madang  \n",
       "2  18417.507717  Mount Hagen  "
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Undirected Delta Pathing for Bogota already exists. Creation skipped.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Source</th>\n",
       "      <th>Bridges</th>\n",
       "      <th>Partial_Costs</th>\n",
       "      <th>Total_Cost</th>\n",
       "      <th>Target</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Bogota</td>\n",
       "      <td>[Goroka, Port Moresby, Panama City, Nandi, Bogota, Los Angeles]</td>\n",
       "      <td>[0.0, 755.8972047746067, 5606.6853979173375, 14508.500729366064, 17901.63346808019, 18326.70207030612]</td>\n",
       "      <td>18326.702070</td>\n",
       "      <td>Goroka</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Bogota</td>\n",
       "      <td>[Madang, Port Moresby, Panama City, Nandi, Bogota, Los Angeles]</td>\n",
       "      <td>[0.0, 755.8972047746067, 5606.6853979173375, 14508.500729366064, 17901.63346808019, 18398.968325213587]</td>\n",
       "      <td>18398.968325</td>\n",
       "      <td>Madang</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Bogota</td>\n",
       "      <td>[Mount Hagen, Port Moresby, Panama City, Nandi, Bogota, Los Angeles]</td>\n",
       "      <td>[0.0, 755.8972047746067, 5606.6853979173375, 14508.500729366064, 17901.63346808019, 18417.507717458266]</td>\n",
       "      <td>18417.507717</td>\n",
       "      <td>Mount Hagen</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   Source  \\\n",
       "0  Bogota   \n",
       "1  Bogota   \n",
       "2  Bogota   \n",
       "\n",
       "                                                                Bridges  \\\n",
       "0       [Goroka, Port Moresby, Panama City, Nandi, Bogota, Los Angeles]   \n",
       "1       [Madang, Port Moresby, Panama City, Nandi, Bogota, Los Angeles]   \n",
       "2  [Mount Hagen, Port Moresby, Panama City, Nandi, Bogota, Los Angeles]   \n",
       "\n",
       "                                                                                             Partial_Costs  \\\n",
       "0   [0.0, 755.8972047746067, 5606.6853979173375, 14508.500729366064, 17901.63346808019, 18326.70207030612]   \n",
       "1  [0.0, 755.8972047746067, 5606.6853979173375, 14508.500729366064, 17901.63346808019, 18398.968325213587]   \n",
       "2  [0.0, 755.8972047746067, 5606.6853979173375, 14508.500729366064, 17901.63346808019, 18417.507717458266]   \n",
       "\n",
       "     Total_Cost       Target  \n",
       "0  18326.702070       Goroka  \n",
       "1  18398.968325       Madang  \n",
       "2  18417.507717  Mount Hagen  "
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "db.delta_pathing('Airport', 'Label', 'Bogota', 'distance')"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "422c90a2",
   "metadata": {},
   "source": [
    "Los aeropuertos y rutas visitables que sumen menos de 20,000 km:"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "id": "c80bef46",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Distinct_Visitable_Airports</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>3001</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   Distinct_Visitable_Airports\n",
       "0                         3001"
      ]
     },
     "execution_count": 14,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query2 = \"\"\"MATCH (source:Airport) -[r:PATH_Bogota_Directed]-> (target:Airport)\n",
    "WHERE r.totalCost <= 20_000 \n",
    "RETURN COUNT(DISTINCT target.Label) AS Distinct_Visitable_Airports\n",
    "\"\"\"\n",
    " \n",
    "db.custom_query(query2)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "id": "ea9e79fa",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Source</th>\n",
       "      <th>Target</th>\n",
       "      <th>Bridges</th>\n",
       "      <th>Target_Country</th>\n",
       "      <th>Kilometers</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Bogota</td>\n",
       "      <td>Goroka</td>\n",
       "      <td>[Goroka, Port Moresby, Panama City, Nandi, Bogota, Los Angeles]</td>\n",
       "      <td>Papua New Guinea</td>\n",
       "      <td>18326.702070</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Bogota</td>\n",
       "      <td>Madang</td>\n",
       "      <td>[Madang, Port Moresby, Panama City, Nandi, Bogota, Los Angeles]</td>\n",
       "      <td>Papua New Guinea</td>\n",
       "      <td>18398.968325</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Bogota</td>\n",
       "      <td>Mount Hagen</td>\n",
       "      <td>[Mount Hagen, Port Moresby, Panama City, Nandi, Bogota, Los Angeles]</td>\n",
       "      <td>Papua New Guinea</td>\n",
       "      <td>18417.507717</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Bogota</td>\n",
       "      <td>Nadzab</td>\n",
       "      <td>[Nadzab, Port Moresby, Panama City, Nandi, Bogota, Los Angeles]</td>\n",
       "      <td>Papua New Guinea</td>\n",
       "      <td>18226.120224</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Bogota</td>\n",
       "      <td>Port Moresby</td>\n",
       "      <td>[Port Moresby, Panama City, Nandi, Bogota, Los Angeles]</td>\n",
       "      <td>Papua New Guinea</td>\n",
       "      <td>17901.633468</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>Bogota</td>\n",
       "      <td>Wewak</td>\n",
       "      <td>[Port Moresby, Wewak, Panama City, Nandi, Bogota, Los Angeles]</td>\n",
       "      <td>Papua New Guinea</td>\n",
       "      <td>18662.934623</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>Bogota</td>\n",
       "      <td>Narssarssuaq</td>\n",
       "      <td>[Narssarssuaq, Godthaab, Keflavik, Santo Domingo, Bogota, Boston]</td>\n",
       "      <td>Greenland</td>\n",
       "      <td>10016.244656</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>Bogota</td>\n",
       "      <td>Godthaab</td>\n",
       "      <td>[Godthaab, Keflavik, Santo Domingo, Bogota, Boston]</td>\n",
       "      <td>Greenland</td>\n",
       "      <td>9552.032638</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>Bogota</td>\n",
       "      <td>Sondrestrom</td>\n",
       "      <td>[Godthaab, Sondrestrom, Keflavik, Santo Domingo, Bogota, Boston]</td>\n",
       "      <td>Greenland</td>\n",
       "      <td>9869.219679</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>Bogota</td>\n",
       "      <td>Thule</td>\n",
       "      <td>[Godthaab, Thule, Keflavik, Santo Domingo, Bogota, Boston, Ilulissat, Qaanaaq, Upernavik]</td>\n",
       "      <td>Greenland</td>\n",
       "      <td>11300.657141</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>Bogota</td>\n",
       "      <td>Akureyri</td>\n",
       "      <td>[Godthaab, Akureyri, Keflavik, Reykjavik, Santo Domingo, Bogota, Boston]</td>\n",
       "      <td>Iceland</td>\n",
       "      <td>11231.414101</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>Bogota</td>\n",
       "      <td>Egilsstadir</td>\n",
       "      <td>[Godthaab, Egilsstadir, Keflavik, Reykjavik, Santo Domingo, Bogota, Boston]</td>\n",
       "      <td>Iceland</td>\n",
       "      <td>11362.315578</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>Bogota</td>\n",
       "      <td>Isafjordur</td>\n",
       "      <td>[Godthaab, Isafjordur, Keflavik, Reykjavik, Santo Domingo, Bogota, Boston]</td>\n",
       "      <td>Iceland</td>\n",
       "      <td>11203.541950</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>Bogota</td>\n",
       "      <td>Keflavik</td>\n",
       "      <td>[Keflavik, Santo Domingo, Bogota, Boston]</td>\n",
       "      <td>Iceland</td>\n",
       "      <td>8149.907903</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>Bogota</td>\n",
       "      <td>Reykjavik</td>\n",
       "      <td>[Godthaab, Keflavik, Reykjavik, Santo Domingo, Bogota, Boston]</td>\n",
       "      <td>Iceland</td>\n",
       "      <td>10981.729726</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>Bogota</td>\n",
       "      <td>Sault Sainte Marie</td>\n",
       "      <td>[Sault Sainte Marie, Toronto, Bogota]</td>\n",
       "      <td>Canada</td>\n",
       "      <td>4866.658445</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>Bogota</td>\n",
       "      <td>St. Anthony</td>\n",
       "      <td>[St. Anthony, Halifax, Goose Bay, Punta Cana, Bogota]</td>\n",
       "      <td>Canada</td>\n",
       "      <td>5960.885142</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>Bogota</td>\n",
       "      <td>Baie Comeau</td>\n",
       "      <td>[Baie Comeau, Quebec, Bogota, Newark]</td>\n",
       "      <td>Canada</td>\n",
       "      <td>5073.708911</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>Bogota</td>\n",
       "      <td>Bagotville</td>\n",
       "      <td>[Bagotville, Montreal, Bogota, New York]</td>\n",
       "      <td>Canada</td>\n",
       "      <td>4919.210857</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>Bogota</td>\n",
       "      <td>Baker Lake</td>\n",
       "      <td>[Baker Lake, Rankin Inlet, Winnipeg, Bogota, Atlanta, Minneapolis]</td>\n",
       "      <td>Canada</td>\n",
       "      <td>7216.236215</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "    Source              Target  \\\n",
       "0   Bogota              Goroka   \n",
       "1   Bogota              Madang   \n",
       "2   Bogota         Mount Hagen   \n",
       "3   Bogota              Nadzab   \n",
       "4   Bogota        Port Moresby   \n",
       "5   Bogota               Wewak   \n",
       "6   Bogota        Narssarssuaq   \n",
       "7   Bogota            Godthaab   \n",
       "8   Bogota         Sondrestrom   \n",
       "9   Bogota               Thule   \n",
       "10  Bogota            Akureyri   \n",
       "11  Bogota         Egilsstadir   \n",
       "12  Bogota          Isafjordur   \n",
       "13  Bogota            Keflavik   \n",
       "14  Bogota           Reykjavik   \n",
       "15  Bogota  Sault Sainte Marie   \n",
       "16  Bogota         St. Anthony   \n",
       "17  Bogota         Baie Comeau   \n",
       "18  Bogota          Bagotville   \n",
       "19  Bogota          Baker Lake   \n",
       "\n",
       "                                                                                      Bridges  \\\n",
       "0                             [Goroka, Port Moresby, Panama City, Nandi, Bogota, Los Angeles]   \n",
       "1                             [Madang, Port Moresby, Panama City, Nandi, Bogota, Los Angeles]   \n",
       "2                        [Mount Hagen, Port Moresby, Panama City, Nandi, Bogota, Los Angeles]   \n",
       "3                             [Nadzab, Port Moresby, Panama City, Nandi, Bogota, Los Angeles]   \n",
       "4                                     [Port Moresby, Panama City, Nandi, Bogota, Los Angeles]   \n",
       "5                              [Port Moresby, Wewak, Panama City, Nandi, Bogota, Los Angeles]   \n",
       "6                           [Narssarssuaq, Godthaab, Keflavik, Santo Domingo, Bogota, Boston]   \n",
       "7                                         [Godthaab, Keflavik, Santo Domingo, Bogota, Boston]   \n",
       "8                            [Godthaab, Sondrestrom, Keflavik, Santo Domingo, Bogota, Boston]   \n",
       "9   [Godthaab, Thule, Keflavik, Santo Domingo, Bogota, Boston, Ilulissat, Qaanaaq, Upernavik]   \n",
       "10                   [Godthaab, Akureyri, Keflavik, Reykjavik, Santo Domingo, Bogota, Boston]   \n",
       "11                [Godthaab, Egilsstadir, Keflavik, Reykjavik, Santo Domingo, Bogota, Boston]   \n",
       "12                 [Godthaab, Isafjordur, Keflavik, Reykjavik, Santo Domingo, Bogota, Boston]   \n",
       "13                                                  [Keflavik, Santo Domingo, Bogota, Boston]   \n",
       "14                             [Godthaab, Keflavik, Reykjavik, Santo Domingo, Bogota, Boston]   \n",
       "15                                                      [Sault Sainte Marie, Toronto, Bogota]   \n",
       "16                                      [St. Anthony, Halifax, Goose Bay, Punta Cana, Bogota]   \n",
       "17                                                      [Baie Comeau, Quebec, Bogota, Newark]   \n",
       "18                                                   [Bagotville, Montreal, Bogota, New York]   \n",
       "19                         [Baker Lake, Rankin Inlet, Winnipeg, Bogota, Atlanta, Minneapolis]   \n",
       "\n",
       "      Target_Country    Kilometers  \n",
       "0   Papua New Guinea  18326.702070  \n",
       "1   Papua New Guinea  18398.968325  \n",
       "2   Papua New Guinea  18417.507717  \n",
       "3   Papua New Guinea  18226.120224  \n",
       "4   Papua New Guinea  17901.633468  \n",
       "5   Papua New Guinea  18662.934623  \n",
       "6          Greenland  10016.244656  \n",
       "7          Greenland   9552.032638  \n",
       "8          Greenland   9869.219679  \n",
       "9          Greenland  11300.657141  \n",
       "10           Iceland  11231.414101  \n",
       "11           Iceland  11362.315578  \n",
       "12           Iceland  11203.541950  \n",
       "13           Iceland   8149.907903  \n",
       "14           Iceland  10981.729726  \n",
       "15            Canada   4866.658445  \n",
       "16            Canada   5960.885142  \n",
       "17            Canada   5073.708911  \n",
       "18            Canada   4919.210857  \n",
       "19            Canada   7216.236215  "
      ]
     },
     "execution_count": 15,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query3 = \"\"\"MATCH (source:Airport) -[r:PATH_Bogota_Directed]-> (target:Airport)\n",
    "MATCH (v:Airport)\n",
    "WHERE r.totalCost <= 20_000 AND id(v) IN r.nodeIds\n",
    "RETURN source.Label AS Source, target.Label AS Target, COLLECT(v.Label) AS Bridges, \n",
    "target.country AS Target_Country, r.totalCost AS Kilometers\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    " \n",
    "db.custom_query(query3)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "8431d26b",
   "metadata": {},
   "source": [
    "Algunos de los destinos visitables desde Bogotá a menos de 20,000 km de distancia son Papua New Guinea, Greenland, Iceland y Canada. Las rutas para llegar a cada destino están especificadas en la tabla de arriba, mostrando los países a recorrer."
   ]
  },
  {
   "cell_type": "markdown",
   "id": "6162a906",
   "metadata": {},
   "source": [
    "## <font color= #5aafc1> **Tours** </font>"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "1e8645ac",
   "metadata": {},
   "source": [
    "#### <font color= #93c47d> &nbsp; &nbsp; **Tour 1: The Grand Tour (Europa)** </font>"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "id": "72ecb31f",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Successfully created Airport_Europe Subgraph with Airport nodes and TO relationships!\n"
     ]
    }
   ],
   "source": [
    "# Subgrafo específico de aeropuertos en Europa\n",
    "db.create_subgraph_continent('Airport','TO','Europe')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "id": "237ccf6b",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Error with query: {code: Neo.ClientError.Procedure.ProcedureCallFailed} {message: Failed to invoke procedure `gds.degree.write`: Caused by: org.neo4j.gds.core.loading.GraphNotFoundException: Graph with name `Airport_Europe` does not exist on database `neo5j`. It might exist on another database.}\n"
     ]
    }
   ],
   "source": [
    "# 1\n",
    "db.custom_query(f\"\"\"\n",
    "    CALL gds.degree.write('Airport_Europe', {{writeProperty: 'Out_Degree_Europe'}} )\n",
    "    YIELD centralityDistribution, nodePropertiesWritten\n",
    "    RETURN centralityDistribution.min AS minimumScore, \n",
    "    centralityDistribution.mean AS meanScore, \n",
    "    nodePropertiesWritten;\n",
    "\"\"\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "id": "a2ff5468",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Name</th>\n",
       "      <th>ODE</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "Empty DataFrame\n",
       "Columns: [Name, ODE]\n",
       "Index: []"
      ]
     },
     "execution_count": 18,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "db.custom_query(\"\"\"MATCH (a:Airport {continent:'Europe'})\n",
    "                WHERE a.Out_Degree_Europe IS NOT null\n",
    "                RETURN a.Label AS Name, a.Out_Degree_Europe AS ODE\n",
    "                ORDER BY ODE DESC\n",
    "                LIMIT 10;\"\"\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "id": "5be3b815",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Error with query: {code: Neo.ClientError.Procedure.ProcedureCallFailed} {message: Failed to invoke procedure `gds.pageRank.write`: Caused by: org.neo4j.gds.core.loading.GraphNotFoundException: Graph with name `Airport_Europe` does not exist on database `neo5j`. It might exist on another database.}\n"
     ]
    }
   ],
   "source": [
    "# 2\n",
    "db.custom_query(f\"\"\"\n",
    "    CALL gds.pageRank.write(\n",
    "        'Airport_Europe',\n",
    "        {{writeProperty: 'Page_Rank_Europe'}} )\n",
    "        YIELD nodePropertiesWritten, ranIterations;\n",
    "\"\"\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "id": "09f88ed2",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Germany: Series([], Name: Airport, dtype: object)\n",
      "United Kingdom: Series([], Name: Airport, dtype: object)\n",
      "France: Series([], Name: Airport, dtype: object)\n",
      "Italy: Series([], Name: Airport, dtype: object)\n",
      "Spain: Series([], Name: Airport, dtype: object)\n",
      "Ukraine: Series([], Name: Airport, dtype: object)\n",
      "Poland: Series([], Name: Airport, dtype: object)\n",
      "Romania: Series([], Name: Airport, dtype: object)\n",
      "Netherlands: Series([], Name: Airport, dtype: object)\n",
      "Belgium: Series([], Name: Airport, dtype: object)\n"
     ]
    }
   ],
   "source": [
    "top_europe_countries = ['Germany','United Kingdom','France','Italy','Spain','Ukraine','Poland','Romania','Netherlands','Belgium']\n",
    "\n",
    "for i in top_europe_countries:\n",
    "    result = db.custom_query(f\"\"\"\n",
    "    MATCH (a:Airport {{country: '{i}'}})\n",
    "    WHERE a.Page_Rank_Europe IS NOT NULL\n",
    "    RETURN a.Label AS Airport, a.Page_Rank_Europe AS PR\n",
    "    ORDER BY PR DESC\n",
    "    LIMIT 1;\n",
    "    \"\"\")\n",
    "\n",
    "    print(f\"{i}: {result['Airport']}\")\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 40,
   "id": "c8b37112",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "    Ruta GDL-Munich: 0    10031.953936\n",
      "Name: Distance, dtype: float64 \n",
      "\n",
      "    Middle Airports: 0    [Guadalajara, Houston, Munich]\n",
      "Name: Bridges, dtype: object\n",
      "\n",
      "\n",
      "    Ruta GDL-London: 0    3358.698645\n",
      "1    9086.463951\n",
      "2    9126.420797\n",
      "3    9131.317161\n",
      "4    9094.852864\n",
      "5    9123.639416\n",
      "Name: Distance, dtype: float64 \n",
      "\n",
      "    Middle Airports: 0                     [Guadalajara, Chicago, London]\n",
      "1    [Guadalajara, Houston, Toronto, Dublin, London]\n",
      "2           [Guadalajara, Houston, Montreal, London]\n",
      "3    [Guadalajara, Houston, Toronto, Dublin, London]\n",
      "4                     [Guadalajara, Houston, London]\n",
      "5    [Guadalajara, Houston, Toronto, Dublin, London]\n",
      "Name: Bridges, dtype: object\n",
      "\n",
      "\n",
      "    Ruta GDL-Paris: 0    9403.563969\n",
      "1    9407.824968\n",
      "Name: Distance, dtype: float64 \n",
      "\n",
      "    Middle Airports: 0              [Guadalajara, Houston, Paris]\n",
      "1    [Guadalajara, Houston, Montreal, Paris]\n",
      "Name: Bridges, dtype: object\n",
      "\n",
      "\n",
      "    Ruta GDL-Rome: 0    10517.777807\n",
      "1    10460.905875\n",
      "Name: Distance, dtype: float64 \n",
      "\n",
      "    Middle Airports: 0    [Guadalajara, Houston, Montreal, Marseille, Rome]\n",
      "1                         [Guadalajara, Atlanta, Rome]\n",
      "Name: Bridges, dtype: object\n",
      "\n",
      "\n",
      "    Ruta GDL-Barcelona: 0    9746.264626\n",
      "1    4296.911075\n",
      "Name: Distance, dtype: float64 \n",
      "\n",
      "    Middle Airports: 0    [Guadalajara, Atlanta, Philadelphia, Barcelona]\n",
      "1     [Guadalajara, Mexico City, Caracas, Barcelona]\n",
      "Name: Bridges, dtype: object\n",
      "\n",
      "\n",
      "    Ruta GDL-Kiev: 0    10979.090423\n",
      "1    10955.689394\n",
      "Name: Distance, dtype: float64 \n",
      "\n",
      "    Middle Airports: 0    [Guadalajara, Chicago, Stockholm, Vilnius, Kiev]\n",
      "1    [Guadalajara, Chicago, Stockholm, Vilnius, Kiev]\n",
      "Name: Bridges, dtype: object\n",
      "\n",
      "\n",
      "    Ruta GDL-Warsaw: 0    10319.829047\n",
      "1    10308.471303\n",
      "Name: Distance, dtype: float64 \n",
      "\n",
      "    Middle Airports: 0                        [Guadalajara, Chicago, Warsaw]\n",
      "1    [Guadalajara, Chicago, Copenhagen, Gdansk, Warsaw]\n",
      "Name: Bridges, dtype: object\n",
      "\n",
      "\n",
      "    Ruta GDL-Bucharest: 0    11166.687239\n",
      "Name: Distance, dtype: float64 \n",
      "\n",
      "    Middle Airports: 0    [Guadalajara, Houston, Amsterdam, Bucharest]\n",
      "Name: Bridges, dtype: object\n",
      "\n",
      "\n",
      "    Ruta GDL-Amsterdam: 0    9381.485099\n",
      "Name: Distance, dtype: float64 \n",
      "\n",
      "    Middle Airports: 0    [Guadalajara, Houston, Amsterdam]\n",
      "Name: Bridges, dtype: object\n",
      "\n",
      "\n",
      "    Ruta GDL-Brussels: 0    9434.875604\n",
      "Name: Distance, dtype: float64 \n",
      "\n",
      "    Middle Airports: 0    [Guadalajara, Houston, Montreal, Brussels]\n",
      "Name: Bridges, dtype: object\n",
      "\n"
     ]
    }
   ],
   "source": [
    "# 3\n",
    "cities = ['Munich','London','Paris','Rome','Barcelona','Kiev','Warsaw','Bucharest','Amsterdam','Brussels']\n",
    "\n",
    "for i in cities:\n",
    "    result = db.temp_dijkstra_directed('Airport','Label','Guadalajara',i,'distance')\n",
    "    print(f\"\"\"\n",
    "    Ruta GDL-{i}: {result[\"Distance\"]} \\n\n",
    "    Middle Airports: {result['Bridges']}\n",
    "\"\"\")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "13f4380f",
   "metadata": {},
   "source": [
    "Estas rutas son complejas y difíciles de tratar para una persona turista, por ende se propone la ruta de GDL a Londres via la CDMX, la cuál es apenas 300 km más larga pero es logísticamente más sencilla"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "37a6290a",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "application/vnd.microsoft.datawrangler.viewer.v0+json": {
       "columns": [
        {
         "name": "index",
         "rawType": "int64",
         "type": "integer"
        },
        {
         "name": "r.distance + r2.distance",
         "rawType": "float64",
         "type": "float"
        },
        {
         "name": "a3.Id",
         "rawType": "int64",
         "type": "integer"
        }
       ],
       "ref": "b2c48a05-a40c-4d90-9352-f57878fba746",
       "rows": [
        [
         "0",
         "9373.457895766884",
         "507"
        ]
       ],
       "shape": {
        "columns": 2,
        "rows": 1
       }
      },
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>r.distance + r2.distance</th>\n",
       "      <th>a3.Id</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>9373.457896</td>\n",
       "      <td>507</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   r.distance + r2.distance  a3.Id\n",
       "0               9373.457896    507"
      ]
     },
     "execution_count": 44,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "db.custom_query(f\"MATCH (a:Airport {{Label:'Guadalajara'}})-[r:TO]->(a2:Airport {{Label: 'Mexico City'}})-[r2:TO]->(a3:Airport {{Label: 'London'}}) RETURN r.distance + r2.distance, a3.Id\")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "8dde2d08",
   "metadata": {},
   "source": [
    "De forma similar, para el retorno, se propone la siguiente ruta: Barcelona-GDL via Londres y CDMX"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "5b322248",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "application/vnd.microsoft.datawrangler.viewer.v0+json": {
       "columns": [
        {
         "name": "index",
         "rawType": "int64",
         "type": "integer"
        },
        {
         "name": "r.distance",
         "rawType": "float64",
         "type": "float"
        },
        {
         "name": "a2.Id",
         "rawType": "int64",
         "type": "integer"
        }
       ],
       "ref": "743680e1-5912-4fff-b904-84dc30b26a09",
       "rows": [
        [
         "0",
         "1192.0972728944823",
         "492"
        ],
        [
         "1",
         "1110.296837269539",
         "502"
        ],
        [
         "2",
         "1148.9991081544574",
         "507"
        ],
        [
         "3",
         "1186.9421881696337",
         "548"
        ]
       ],
       "shape": {
        "columns": 2,
        "rows": 4
       }
      },
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>r.distance</th>\n",
       "      <th>a2.Id</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1192.097273</td>\n",
       "      <td>492</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>1110.296837</td>\n",
       "      <td>502</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>1148.999108</td>\n",
       "      <td>507</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>1186.942188</td>\n",
       "      <td>548</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "    r.distance  a2.Id\n",
       "0  1192.097273    492\n",
       "1  1110.296837    502\n",
       "2  1148.999108    507\n",
       "3  1186.942188    548"
      ]
     },
     "execution_count": 43,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "db.custom_query(f\"MATCH (a:Airport {{Label:'Barcelona'}})-[r:TO]->(a2:Airport {{Label: 'London'}})RETURN r.distance, a2.Id\") # se va a tomar el aeropuerto con id=507"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "75a2f8c1",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "    Grand Tour Report: \n",
      "\n",
      "    Total Distance: 0    23536.266188\n",
      "1             NaN\n",
      "Name: Dist, dtype: float64\n",
      "    Cost Per Leg: \n",
      "\n"
     ]
    }
   ],
   "source": [
    "# 4\n",
    "grand_1 = db.custom_query(f\"\"\"\n",
    "    MATCH (a:Airport {{Id:507}})-[r:TO]->(a2:Airport {{Label:'Munich'}}) \n",
    "    RETURN r.distance AS Dist;\n",
    "\"\"\") # En este caso, identifico a Londres con su Id específico ya que hay varios aeropuertos con el Label:\"Londres\". Este es el mismo aeropuerto en el que llegamos\n",
    "\n",
    "grand_2 = db.custom_query(f\"\"\"\n",
    "    MATCH (a:Airport {{Label:'Munich'}})-[r:TO]->(a2:Airport {{Label:'Paris'}}) \n",
    "    RETURN r.distance AS Dist;\n",
    "\"\"\")\n",
    "\n",
    "grand_3 = db.custom_query(f\"\"\"\n",
    "    MATCH (a:Airport {{Label:'Paris'}})-[r:TO]->(a2:Airport {{Label:'Rome'}}) \n",
    "    RETURN r.distance AS Dist;\n",
    "\"\"\")\n",
    "\n",
    "grand_4 = db.custom_query(f\"\"\"\n",
    "    MATCH (a:Airport {{Label:'Rome'}})-[r:TO]->(a2:Airport {{Label:'Barcelona'}}) \n",
    "    RETURN r.distance AS Dist;\n",
    "\"\"\")\n",
    "\n",
    "grand_f = db.temp_dijkstra_directed('Airport','Label','Barcelona','Guadalajara','distance')\n",
    "\n",
    "print(f\"\"\"\n",
    "    Grand Tour Report: \\n\n",
    "    Total Distance: {9373+grand_1['Dist']+grand_2['Dist']+grand_3['Dist']+grand_4['Dist']+(1186+9373)}\n",
    "    Cost Per Leg: \n",
    "\"\"\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "37b323ce",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "application/vnd.microsoft.datawrangler.viewer.v0+json": {
       "columns": [
        {
         "name": "index",
         "rawType": "int64",
         "type": "integer"
        },
        {
         "name": "Source",
         "rawType": "object",
         "type": "string"
        },
        {
         "name": "Target",
         "rawType": "object",
         "type": "string"
        },
        {
         "name": "Middle",
         "rawType": "object",
         "type": "unknown"
        },
        {
         "name": "Distance",
         "rawType": "float64",
         "type": "float"
        }
       ],
       "ref": "e50ff296-fa8e-4242-a78a-b1184f753ef8",
       "rows": [
        [
         "0",
         "Barcelona",
         "Guadalajara",
         "[570, 1854, 1809, 818]",
         "9746.264625621985"
        ],
        [
         "1",
         "Barcelona",
         "Guadalajara",
         "[1329, 1340, 832, 818]",
         "4296.911075219556"
        ]
       ],
       "shape": {
        "columns": 4,
        "rows": 2
       }
      },
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Source</th>\n",
       "      <th>Target</th>\n",
       "      <th>Middle</th>\n",
       "      <th>Distance</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Barcelona</td>\n",
       "      <td>Guadalajara</td>\n",
       "      <td>[570, 1854, 1809, 818]</td>\n",
       "      <td>9746.264626</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Barcelona</td>\n",
       "      <td>Guadalajara</td>\n",
       "      <td>[1329, 1340, 832, 818]</td>\n",
       "      <td>4296.911075</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "      Source       Target                  Middle     Distance\n",
       "0  Barcelona  Guadalajara  [570, 1854, 1809, 818]  9746.264626\n",
       "1  Barcelona  Guadalajara  [1329, 1340, 832, 818]  4296.911075"
      ]
     },
     "execution_count": 39,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "db.temp_dijkstra_directed('Airport','Label','Barcelona','Guadalajara','distance')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "3d82d172",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "application/vnd.microsoft.datawrangler.viewer.v0+json": {
       "columns": [
        {
         "name": "index",
         "rawType": "int64",
         "type": "integer"
        },
        {
         "name": "communityCount",
         "rawType": "int64",
         "type": "integer"
        },
        {
         "name": "modularity",
         "rawType": "float64",
         "type": "float"
        },
        {
         "name": "modularities",
         "rawType": "object",
         "type": "unknown"
        }
       ],
       "ref": "0002a0a8-c816-47b2-b0e2-6cd7a364ac6e",
       "rows": [
        [
         "0",
         "8",
         "0.26782181796958543",
         "[0.2541399296152414, 0.26615043547199513, 0.26782181796958543]"
        ]
       ],
       "shape": {
        "columns": 3,
        "rows": 1
       }
      },
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>communityCount</th>\n",
       "      <th>modularity</th>\n",
       "      <th>modularities</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>8</td>\n",
       "      <td>0.267822</td>\n",
       "      <td>[0.2541399296152414, 0.26615043547199513, 0.26782181796958543]</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   communityCount  modularity  \\\n",
       "0               8    0.267822   \n",
       "\n",
       "                                                     modularities  \n",
       "0  [0.2541399296152414, 0.26615043547199513, 0.26782181796958543]  "
      ]
     },
     "execution_count": 48,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# 5\n",
    "db.custom_query(f\"\"\"CALL gds.louvain.write(\n",
    "            'Airport_Europe',\n",
    "            {{writeProperty: 'Louvain_Europe'}} )\n",
    "            YIELD communityCount, modularity, modularities;\n",
    "            \"\"\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "00cae362",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "application/vnd.microsoft.datawrangler.viewer.v0+json": {
       "columns": [
        {
         "name": "index",
         "rawType": "int64",
         "type": "integer"
        },
        {
         "name": "LV",
         "rawType": "float64",
         "type": "float"
        },
        {
         "name": "Countries",
         "rawType": "object",
         "type": "unknown"
        }
       ],
       "ref": "7a7bccfe-04b3-44ac-8b40-1eab238cfc5d",
       "rows": [
        [
         "0",
         "1.0",
         "['Iceland']"
        ],
        [
         "1",
         "45.0",
         "['Iceland', 'Estonia', 'Finland', 'United Kingdom', 'Netherlands', 'Denmark', 'Faroe Islands', 'Norway', 'Poland', 'Sweden', 'Bulgaria', 'Cyprus', 'Azerbaijan', 'Ukraine', 'Belarus', 'Latvia', 'Lithuania', 'Armenia', 'Georgia']"
        ],
        [
         "2",
         "66.0",
         "['Belgium', 'Germany', 'United Kingdom', 'Netherlands', 'Spain', 'Albania', 'France', 'Greece', 'Italy', 'Czech Republic', 'Portugal', 'Switzerland', 'Montenegro']"
        ],
        [
         "3",
         "135.0",
         "['Belgium', 'Germany', 'Finland', 'United Kingdom', 'Netherlands', 'Norway', 'Poland', 'Sweden', 'Bulgaria', 'Croatia', 'Spain', 'France', 'Greece', 'Hungary', 'Italy', 'Czech Republic', 'Bosnia and Herzegovina', 'Romania', 'Moldova', 'Macedonia', 'Slovakia', 'Ukraine']"
        ],
        [
         "4",
         "128.0",
         "['Germany', 'United Kingdom', 'Guernsey', 'Jersey', 'Isle of Man', 'Ireland', 'Poland', 'Sweden', 'Spain', 'Cyprus', 'France', 'Malta', 'Portugal', 'Gibraltar', 'Lithuania']"
        ],
        [
         "5",
         "457.0",
         "['Germany', 'Luxembourg', 'Spain', 'Bulgaria', 'Croatia', 'Greece', 'Italy', 'Slovenia', 'Austria', 'Bosnia and Herzegovina', 'Romania', 'Switzerland', 'Serbia', 'Montenegro', 'Slovakia', 'Portugal']"
        ],
        [
         "6",
         "314.0",
         "['United Kingdom']"
        ],
        [
         "7",
         null,
         "['Italy', 'Czech Republic', 'Romania', 'Armenia', 'Cyprus', 'France', 'Ukraine', 'Azerbaijan']"
        ],
        [
         "8",
         "477.0",
         "['Portugal']"
        ]
       ],
       "shape": {
        "columns": 2,
        "rows": 9
       }
      },
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>LV</th>\n",
       "      <th>Countries</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1.0</td>\n",
       "      <td>[Iceland]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>45.0</td>\n",
       "      <td>[Iceland, Estonia, Finland, United Kingdom, Netherlands, Denmark, Faroe Islands, Norway, Poland, Sweden, Bulgaria, Cyprus, Azerbaijan, Ukraine, Belarus, Latvia, Lithuania, Armenia, Georgia]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>66.0</td>\n",
       "      <td>[Belgium, Germany, United Kingdom, Netherlands, Spain, Albania, France, Greece, Italy, Czech Republic, Portugal, Switzerland, Montenegro]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>135.0</td>\n",
       "      <td>[Belgium, Germany, Finland, United Kingdom, Netherlands, Norway, Poland, Sweden, Bulgaria, Croatia, Spain, France, Greece, Hungary, Italy, Czech Republic, Bosnia and Herzegovina, Romania, Moldova, Macedonia, Slovakia, Ukraine]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>128.0</td>\n",
       "      <td>[Germany, United Kingdom, Guernsey, Jersey, Isle of Man, Ireland, Poland, Sweden, Spain, Cyprus, France, Malta, Portugal, Gibraltar, Lithuania]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>457.0</td>\n",
       "      <td>[Germany, Luxembourg, Spain, Bulgaria, Croatia, Greece, Italy, Slovenia, Austria, Bosnia and Herzegovina, Romania, Switzerland, Serbia, Montenegro, Slovakia, Portugal]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>314.0</td>\n",
       "      <td>[United Kingdom]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>NaN</td>\n",
       "      <td>[Italy, Czech Republic, Romania, Armenia, Cyprus, France, Ukraine, Azerbaijan]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>477.0</td>\n",
       "      <td>[Portugal]</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "      LV  \\\n",
       "0    1.0   \n",
       "1   45.0   \n",
       "2   66.0   \n",
       "3  135.0   \n",
       "4  128.0   \n",
       "5  457.0   \n",
       "6  314.0   \n",
       "7    NaN   \n",
       "8  477.0   \n",
       "\n",
       "                                                                                                                                                                                                                            Countries  \n",
       "0                                                                                                                                                                                                                           [Iceland]  \n",
       "1                                       [Iceland, Estonia, Finland, United Kingdom, Netherlands, Denmark, Faroe Islands, Norway, Poland, Sweden, Bulgaria, Cyprus, Azerbaijan, Ukraine, Belarus, Latvia, Lithuania, Armenia, Georgia]  \n",
       "2                                                                                           [Belgium, Germany, United Kingdom, Netherlands, Spain, Albania, France, Greece, Italy, Czech Republic, Portugal, Switzerland, Montenegro]  \n",
       "3  [Belgium, Germany, Finland, United Kingdom, Netherlands, Norway, Poland, Sweden, Bulgaria, Croatia, Spain, France, Greece, Hungary, Italy, Czech Republic, Bosnia and Herzegovina, Romania, Moldova, Macedonia, Slovakia, Ukraine]  \n",
       "4                                                                                     [Germany, United Kingdom, Guernsey, Jersey, Isle of Man, Ireland, Poland, Sweden, Spain, Cyprus, France, Malta, Portugal, Gibraltar, Lithuania]  \n",
       "5                                                             [Germany, Luxembourg, Spain, Bulgaria, Croatia, Greece, Italy, Slovenia, Austria, Bosnia and Herzegovina, Romania, Switzerland, Serbia, Montenegro, Slovakia, Portugal]  \n",
       "6                                                                                                                                                                                                                    [United Kingdom]  \n",
       "7                                                                                                                                                      [Italy, Czech Republic, Romania, Armenia, Cyprus, France, Ukraine, Azerbaijan]  \n",
       "8                                                                                                                                                                                                                          [Portugal]  "
      ]
     },
     "execution_count": 49,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "db.custom_query(f\"\"\"\n",
    "    MATCH (a:Airport {{continent:'Europe'}})\n",
    "    RETURN a.Louvain_Europe AS LV, COLLECT(DISTINCT a.country) AS Countries\n",
    "\"\"\")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "6c87f7b2",
   "metadata": {},
   "source": [
    "#### <font color= #d04e4e> &nbsp; &nbsp; **Tour 2: The Rising Sun (Asia)** </font>"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "44fefede",
   "metadata": {},
   "source": [
    "Crear una nueva label para Asia:"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "id": "031ba1a2",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>a.Label</th>\n",
       "      <th>a.country</th>\n",
       "      <th>a.continent</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Tel-aviv</td>\n",
       "      <td>Israel</td>\n",
       "      <td>Asia</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Elat</td>\n",
       "      <td>Israel</td>\n",
       "      <td>Asia</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Haifa</td>\n",
       "      <td>Israel</td>\n",
       "      <td>Asia</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Ovda</td>\n",
       "      <td>Israel</td>\n",
       "      <td>Asia</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Tel-aviv</td>\n",
       "      <td>Israel</td>\n",
       "      <td>Asia</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>Ankara</td>\n",
       "      <td>Turkey</td>\n",
       "      <td>Asia</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>Adana</td>\n",
       "      <td>Turkey</td>\n",
       "      <td>Asia</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>Antalya</td>\n",
       "      <td>Turkey</td>\n",
       "      <td>Asia</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>Gaziantep</td>\n",
       "      <td>Turkey</td>\n",
       "      <td>Asia</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>Konya</td>\n",
       "      <td>Turkey</td>\n",
       "      <td>Asia</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "     a.Label a.country a.continent\n",
       "0   Tel-aviv    Israel        Asia\n",
       "1       Elat    Israel        Asia\n",
       "2      Haifa    Israel        Asia\n",
       "3       Ovda    Israel        Asia\n",
       "4   Tel-aviv    Israel        Asia\n",
       "5     Ankara    Turkey        Asia\n",
       "6      Adana    Turkey        Asia\n",
       "7    Antalya    Turkey        Asia\n",
       "8  Gaziantep    Turkey        Asia\n",
       "9      Konya    Turkey        Asia"
      ]
     },
     "execution_count": 22,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query1 = \"\"\"MATCH (a:Airport)\n",
    "WHERE a.continent = 'Asia'\n",
    "SET a:Asia\n",
    "RETURN a.Label, a.country, a.continent\n",
    "LIMIT 10;\n",
    "\"\"\"\n",
    "db.custom_query(query1)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "bff1ecbd",
   "metadata": {},
   "source": [
    "Subgrafos para el continente Asiático:"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "id": "1e2853a5",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Successfully created Directed Subgraph with Asia nodes and TO relationships!\n",
      "Successfully created Undirected Subgraph with Asia nodes and TO relationships!\n"
     ]
    }
   ],
   "source": [
    "db.create_subgraph('Asia', 'TO', 'NATURAL', 'distance')\n",
    "db.create_subgraph('Asia', 'TO', 'UNDIRECTED', 'distance')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "id": "3693bdd7",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>graphName</th>\n",
       "      <th>nodeCount</th>\n",
       "      <th>relationshipCount</th>\n",
       "      <th>database</th>\n",
       "      <th>creationTime</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Undirected_Airport</td>\n",
       "      <td>3214</td>\n",
       "      <td>73814</td>\n",
       "      <td>neo5j</td>\n",
       "      <td>2025-07-16T16:34:42.281446900-06:00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Directed_Asia</td>\n",
       "      <td>885</td>\n",
       "      <td>9492</td>\n",
       "      <td>neo5j</td>\n",
       "      <td>2025-07-16T16:38:00.553513400-06:00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Reversed_Airport</td>\n",
       "      <td>3214</td>\n",
       "      <td>36907</td>\n",
       "      <td>neo5j</td>\n",
       "      <td>2025-07-16T16:34:41.984945900-06:00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Airport_Europe</td>\n",
       "      <td>503</td>\n",
       "      <td>9777</td>\n",
       "      <td>neo5j</td>\n",
       "      <td>2025-07-16T16:35:03.980411300-06:00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Directed_Airport</td>\n",
       "      <td>3214</td>\n",
       "      <td>36907</td>\n",
       "      <td>neo5j</td>\n",
       "      <td>2025-07-16T16:34:41.583769300-06:00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>Undirected_Asia</td>\n",
       "      <td>885</td>\n",
       "      <td>18984</td>\n",
       "      <td>neo5j</td>\n",
       "      <td>2025-07-16T16:38:00.665171300-06:00</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "            graphName  nodeCount  relationshipCount database  \\\n",
       "0  Undirected_Airport       3214              73814    neo5j   \n",
       "1       Directed_Asia        885               9492    neo5j   \n",
       "2    Reversed_Airport       3214              36907    neo5j   \n",
       "3      Airport_Europe        503               9777    neo5j   \n",
       "4    Directed_Airport       3214              36907    neo5j   \n",
       "5     Undirected_Asia        885              18984    neo5j   \n",
       "\n",
       "                          creationTime  \n",
       "0  2025-07-16T16:34:42.281446900-06:00  \n",
       "1  2025-07-16T16:38:00.553513400-06:00  \n",
       "2  2025-07-16T16:34:41.984945900-06:00  \n",
       "3  2025-07-16T16:35:03.980411300-06:00  \n",
       "4  2025-07-16T16:34:41.583769300-06:00  \n",
       "5  2025-07-16T16:38:00.665171300-06:00  "
      ]
     },
     "execution_count": 24,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "db.check_subgraphs()"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "65e204ab",
   "metadata": {},
   "source": [
    "#### <font color= #d04e4e> &nbsp; &nbsp; **Page Rank en Asia** </font>"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "id": "8ea8784e",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Page Rank Attribute added Successfully!\n"
     ]
    }
   ],
   "source": [
    "db.page_rank('Asia')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 26,
   "id": "12273185",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Airport</th>\n",
       "      <th>Country</th>\n",
       "      <th>Page_Rank_Asia</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Moscow</td>\n",
       "      <td>Russia</td>\n",
       "      <td>11.220566</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Beijing</td>\n",
       "      <td>China</td>\n",
       "      <td>10.682839</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Istanbul</td>\n",
       "      <td>Turkey</td>\n",
       "      <td>9.571835</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Guangzhou</td>\n",
       "      <td>China</td>\n",
       "      <td>8.093310</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Shanghai</td>\n",
       "      <td>China</td>\n",
       "      <td>7.933281</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>Dubai</td>\n",
       "      <td>United Arab Emirates</td>\n",
       "      <td>7.749905</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>Singapore</td>\n",
       "      <td>Singapore</td>\n",
       "      <td>7.725984</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>Kuala Lumpur</td>\n",
       "      <td>Malaysia</td>\n",
       "      <td>7.700118</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>Manila</td>\n",
       "      <td>Philippines</td>\n",
       "      <td>7.654879</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>Tokyo</td>\n",
       "      <td>Japan</td>\n",
       "      <td>7.357576</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "        Airport               Country  Page_Rank_Asia\n",
       "0        Moscow                Russia       11.220566\n",
       "1       Beijing                 China       10.682839\n",
       "2      Istanbul                Turkey        9.571835\n",
       "3     Guangzhou                 China        8.093310\n",
       "4      Shanghai                 China        7.933281\n",
       "5         Dubai  United Arab Emirates        7.749905\n",
       "6     Singapore             Singapore        7.725984\n",
       "7  Kuala Lumpur              Malaysia        7.700118\n",
       "8        Manila           Philippines        7.654879\n",
       "9         Tokyo                 Japan        7.357576"
      ]
     },
     "execution_count": 26,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query2 = \"\"\"MATCH (a:Asia)\n",
    "RETURN a.Label AS Airport, a.country AS Country, a.Page_Rank_Asia AS Page_Rank_Asia\n",
    "ORDER BY Page_Rank_Asia DESC\n",
    "LIMIT 10\n",
    "\"\"\"\n",
    "db.custom_query(query2)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "5128bae4",
   "metadata": {},
   "source": [
    "#### <font color= #d04e4e> &nbsp; &nbsp; **Betwenness Centrality en Asia** </font>"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 27,
   "id": "61224da4",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Betweenness Attribute added Successfully!\n"
     ]
    }
   ],
   "source": [
    "db.betwenness('Asia')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "63e820a2",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Airport</th>\n",
       "      <th>Country</th>\n",
       "      <th>Betweenness_Asia</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Beijing</td>\n",
       "      <td>China</td>\n",
       "      <td>91986.036674</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Istanbul</td>\n",
       "      <td>Turkey</td>\n",
       "      <td>74337.337881</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Moscow</td>\n",
       "      <td>Russia</td>\n",
       "      <td>65191.001742</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Dubai</td>\n",
       "      <td>United Arab Emirates</td>\n",
       "      <td>64763.590727</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Singapore</td>\n",
       "      <td>Singapore</td>\n",
       "      <td>62140.411718</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>Kuala Lumpur</td>\n",
       "      <td>Malaysia</td>\n",
       "      <td>52975.485438</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>Manila</td>\n",
       "      <td>Philippines</td>\n",
       "      <td>50537.595223</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>Jakarta</td>\n",
       "      <td>Indonesia</td>\n",
       "      <td>48881.531825</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>Bangkok</td>\n",
       "      <td>Thailand</td>\n",
       "      <td>47495.081555</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>Guangzhou</td>\n",
       "      <td>China</td>\n",
       "      <td>44691.190370</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "        Airport               Country  Betweenness_Asia\n",
       "0       Beijing                 China      91986.036674\n",
       "1      Istanbul                Turkey      74337.337881\n",
       "2        Moscow                Russia      65191.001742\n",
       "3         Dubai  United Arab Emirates      64763.590727\n",
       "4     Singapore             Singapore      62140.411718\n",
       "5  Kuala Lumpur              Malaysia      52975.485438\n",
       "6        Manila           Philippines      50537.595223\n",
       "7       Jakarta             Indonesia      48881.531825\n",
       "8       Bangkok              Thailand      47495.081555\n",
       "9     Guangzhou                 China      44691.190370"
      ]
     },
     "execution_count": 70,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query3 = \"\"\"MATCH (a:Asia)\n",
    "RETURN a.Label AS Airport, a.country AS Country, a.Betweenness_Asia AS Betweenness_Asia\n",
    "ORDER BY Betweenness_Asia DESC\n",
    "LIMIT 10\n",
    "\"\"\"\n",
    "db.custom_query(query3)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "a5e78a9a",
   "metadata": {},
   "source": [
    "#### <font color= #d04e4e> &nbsp; &nbsp; **Recomendaciones en Asia** </font>"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "f22d5560",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Start_Point</th>\n",
       "      <th>Country</th>\n",
       "      <th>Airport_Count</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Moscow</td>\n",
       "      <td>Uzbekistan</td>\n",
       "      <td>11</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Moscow</td>\n",
       "      <td>Kazakhstan</td>\n",
       "      <td>11</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Moscow</td>\n",
       "      <td>China</td>\n",
       "      <td>5</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "  Start_Point     Country  Airport_Count\n",
       "0      Moscow  Uzbekistan             11\n",
       "1      Moscow  Kazakhstan             11\n",
       "2      Moscow       China              5"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Start_Point</th>\n",
       "      <th>Country</th>\n",
       "      <th>Airport_Count</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Beijing</td>\n",
       "      <td>Russia</td>\n",
       "      <td>10</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Beijing</td>\n",
       "      <td>South Korea</td>\n",
       "      <td>6</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Beijing</td>\n",
       "      <td>Japan</td>\n",
       "      <td>5</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "  Start_Point      Country  Airport_Count\n",
       "0     Beijing       Russia             10\n",
       "1     Beijing  South Korea              6\n",
       "2     Beijing        Japan              5"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Start_Point</th>\n",
       "      <th>Country</th>\n",
       "      <th>Airport_Count</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Istanbul</td>\n",
       "      <td>Russia</td>\n",
       "      <td>14</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Istanbul</td>\n",
       "      <td>Saudi Arabia</td>\n",
       "      <td>7</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Istanbul</td>\n",
       "      <td>Iran</td>\n",
       "      <td>6</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "  Start_Point       Country  Airport_Count\n",
       "0    Istanbul        Russia             14\n",
       "1    Istanbul  Saudi Arabia              7\n",
       "2    Istanbul          Iran              6"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Start_Point</th>\n",
       "      <th>Country</th>\n",
       "      <th>Airport_Count</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Guangzhou</td>\n",
       "      <td>Japan</td>\n",
       "      <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Guangzhou</td>\n",
       "      <td>Taiwan</td>\n",
       "      <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Guangzhou</td>\n",
       "      <td>Thailand</td>\n",
       "      <td>3</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "  Start_Point   Country  Airport_Count\n",
       "0   Guangzhou     Japan              3\n",
       "1   Guangzhou    Taiwan              3\n",
       "2   Guangzhou  Thailand              3"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Start_Point</th>\n",
       "      <th>Country</th>\n",
       "      <th>Airport_Count</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Shanghai</td>\n",
       "      <td>Japan</td>\n",
       "      <td>17</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Shanghai</td>\n",
       "      <td>South Korea</td>\n",
       "      <td>6</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Shanghai</td>\n",
       "      <td>Taiwan</td>\n",
       "      <td>3</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "  Start_Point      Country  Airport_Count\n",
       "0    Shanghai        Japan             17\n",
       "1    Shanghai  South Korea              6\n",
       "2    Shanghai       Taiwan              3"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "countries = ['Moscow', 'Beijing', 'Istanbul', 'Guangzhou', 'Shanghai']\n",
    "for i in countries:\n",
    "    query = f\"\"\"MATCH (a:Asia) -[r:TO]-> (a2:Asia)\n",
    "    WHERE a.Label = '{i}' AND a2.country <> a.country\n",
    "    RETURN a.Label AS Start_Point, a2.country AS Country,\n",
    "    COUNT(DISTINCT a2.Label) AS Airport_Count\n",
    "    ORDER BY Airport_Count DESC\n",
    "    LIMIT 3;\n",
    "    \"\"\"\n",
    "    display(db.custom_query(query))"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "3fc9407f",
   "metadata": {},
   "source": [
    "#### <font color= #d04e4e> &nbsp; &nbsp; **Triangle Count en Asia** </font>"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 28,
   "id": "b16eeaa2",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Louvain Attribute added Successfully!\n",
      "Label Propagation Attribute added Successfully!\n",
      "Triangle Count Attribute added Successfully!\n",
      "Local Clustering Coefficient Attribute added Successfully!\n",
      "Strongly CC Attribute added Successfully!\n",
      "Weakly CC Attribute added Successfully!\n",
      "K1-Coloring Attribute added Successfully!\n"
     ]
    }
   ],
   "source": [
    "db.community_algorithms('Asia')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 29,
   "id": "7d4bef46",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Louvain Attribute Color Corrected Successfully!\n",
      "Label_Propagation Attribute Color Corrected Successfully!\n",
      "Triangles Attribute Color Corrected Successfully!\n",
      "localClusteringCoefficient Attribute Color Corrected Successfully!\n",
      "Community_SCC Attribute Color Corrected Successfully!\n",
      "Community_WCC Attribute Color Corrected Successfully!\n",
      "K1Color Attribute Color Corrected Successfully!\n"
     ]
    }
   ],
   "source": [
    "db.color_correction('Asia')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 34,
   "id": "5f4b67ea",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Triangle_Communities</th>\n",
       "      <th>Count</th>\n",
       "      <th>Airports</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1</td>\n",
       "      <td>223</td>\n",
       "      <td>[Ovda, Konya, Merzifon, Denizli, Rafha, Turaif, Wejh, Sanandaj, Zabol, Fujeirah, Khasab, Faisalabad, Gilgit, Panjgur, Zhob, Fengnin, Tainan, Nanki-shirahama, Obihiro, Iki, Tsushima, Monbetsu, Fukue, Kitakyushu, Izumo, Tottori, Tokushima, Hachijojima, Oshima, Kumejima, Cotabato, San Jose, Pevek, Barnaul, Kemorovo, Bhuj, Belgaum, Bhaunagar, Jamnagar, Rajkot, Trinciomalee, Cox's Bazar, Jessore, Kulu, Gwalior, Kanpur, Ludhiaha, Bhairawa, Pokhara, Biratnagar, Agatti Island, Vijayawada, Lampang, Phrae, Narathiwat, Ranong, Trang, Sakon Nakhon, Loei, Kyaukpyu, Myeik, Putao, Wamena, Merauke, Poso, Luwuk, Babo, Limbang, Lahad Datu, Ketapang, Alor Setar, Kerteh, Ipoh, Hotan, Wajima, Naha, Tanjung Pinang, Ende, Labuhan Bajo, Waingapu, Nakhon Si Thammarat, Nakhon Phanom, Ubon Ratchathani, Khon Kaen, Sukhothai, Ataq, Al Ghaidah Intl, Socotra, Nevsehir, Tagbilaran, Phon Savan, Mae Hong Son, Sihanoukville, Roi Et, Buri Ram, Trat, Luang Namtha, Muang Xay, Rach Gia, Ca Mau, ...]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>2</td>\n",
       "      <td>138</td>\n",
       "      <td>[Elat, Haifa, Tel-aviv, Guriat, Hafr Al-batin, Arar, Sharurah, Bandar Mahshahr, Bandar Lengeh, Birjand, Ramsar, Aqaba, Abu Dhabi, Moenjodaro, Matsumoto, Nakashibetsu, Wakkanai, Yamaguchi, Amami, Kochi, Yamagata, Misawa, Kwangju, Yeosu, Ulsan, Pohang, Pagadian, Tacloban, Dumaguete, Caticlan, Stavropol, Magnetiogorsk, Aurangabad, Baroda, Jabalpur, Khajuraho, Porbandar, Surat, Udaipur, Rajshahi, Saidpur, Allahabad, Dehra Dun, Jodhpur, Madurai, Pattaya, Phitsanulok, Hue, Kengtung, Myitkyina, Sittwe, Thandwe, Biak, Nabire, Gorontalo, Pontianak, Jambi, Bengkulu, Kendari, Malang, Tanjung Pandan, Palangkaraya, Maumere, Bima, Redang, Nan, Dong Hoi, Chu Lai, Tuy Hoa, Busuanga, Butuan, Legazpi, Ozamis, Kaadedhdhoo, Diu, Agri, Adiyaman, Dawadmi, Al-Jawf, Noshahr, Ardabil, Chitral, Dalbandin, Fukushima, Sacheon, Sangley Point, Kokshetau, Petropavlosk, Zhezkazgan, Anadyr, Nyagan, Kirov, Kurgan, Termez, Cheboksary, Saransk, Hubli, Dimapur, Laamu Atoll, Haiphong, ...]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>4</td>\n",
       "      <td>57</td>\n",
       "      <td>[Herat, Al-ahsa, El-baha, Bisha, Nejran, Abadan, Gwadar, Rahim Yar Khan, Kinmen, Makung, Memanbetsu, Asahikawa, Hanamaki, Miyako, Romblon, Zamboanga, Uralsk, Pavlodar, Semiplatinsk, Abakan, Bhopal, Agartala, Aizwal, Silchar, Chandigarh, Leh, Bagan, Ternate, Labuan, Banda Aceh, Kuantan, Pyongyang, Xichang, Kashi, Hodeidah, Dalat, Dipolog, Arkhangelsk, Saratov, Uromiyeh, Dera Ghazi Khan, Kushiro, Kostanay, Izhevsk, Andizhan, Khanabad, Pleiku, Bandar Lampung-Sumatra Island, Quzhou, Qiqihar, Dandong, Navoi, Wuzhou, Baise, Yongzhou, Anshun, Jinchuan]</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   Triangle_Communities  Count  \\\n",
       "0                     1    223   \n",
       "1                     2    138   \n",
       "2                     4     57   \n",
       "\n",
       "                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                          Airports  \n",
       "0  [Ovda, Konya, Merzifon, Denizli, Rafha, Turaif, Wejh, Sanandaj, Zabol, Fujeirah, Khasab, Faisalabad, Gilgit, Panjgur, Zhob, Fengnin, Tainan, Nanki-shirahama, Obihiro, Iki, Tsushima, Monbetsu, Fukue, Kitakyushu, Izumo, Tottori, Tokushima, Hachijojima, Oshima, Kumejima, Cotabato, San Jose, Pevek, Barnaul, Kemorovo, Bhuj, Belgaum, Bhaunagar, Jamnagar, Rajkot, Trinciomalee, Cox's Bazar, Jessore, Kulu, Gwalior, Kanpur, Ludhiaha, Bhairawa, Pokhara, Biratnagar, Agatti Island, Vijayawada, Lampang, Phrae, Narathiwat, Ranong, Trang, Sakon Nakhon, Loei, Kyaukpyu, Myeik, Putao, Wamena, Merauke, Poso, Luwuk, Babo, Limbang, Lahad Datu, Ketapang, Alor Setar, Kerteh, Ipoh, Hotan, Wajima, Naha, Tanjung Pinang, Ende, Labuhan Bajo, Waingapu, Nakhon Si Thammarat, Nakhon Phanom, Ubon Ratchathani, Khon Kaen, Sukhothai, Ataq, Al Ghaidah Intl, Socotra, Nevsehir, Tagbilaran, Phon Savan, Mae Hong Son, Sihanoukville, Roi Et, Buri Ram, Trat, Luang Namtha, Muang Xay, Rach Gia, Ca Mau, ...]  \n",
       "1           [Elat, Haifa, Tel-aviv, Guriat, Hafr Al-batin, Arar, Sharurah, Bandar Mahshahr, Bandar Lengeh, Birjand, Ramsar, Aqaba, Abu Dhabi, Moenjodaro, Matsumoto, Nakashibetsu, Wakkanai, Yamaguchi, Amami, Kochi, Yamagata, Misawa, Kwangju, Yeosu, Ulsan, Pohang, Pagadian, Tacloban, Dumaguete, Caticlan, Stavropol, Magnetiogorsk, Aurangabad, Baroda, Jabalpur, Khajuraho, Porbandar, Surat, Udaipur, Rajshahi, Saidpur, Allahabad, Dehra Dun, Jodhpur, Madurai, Pattaya, Phitsanulok, Hue, Kengtung, Myitkyina, Sittwe, Thandwe, Biak, Nabire, Gorontalo, Pontianak, Jambi, Bengkulu, Kendari, Malang, Tanjung Pandan, Palangkaraya, Maumere, Bima, Redang, Nan, Dong Hoi, Chu Lai, Tuy Hoa, Busuanga, Butuan, Legazpi, Ozamis, Kaadedhdhoo, Diu, Agri, Adiyaman, Dawadmi, Al-Jawf, Noshahr, Ardabil, Chitral, Dalbandin, Fukushima, Sacheon, Sangley Point, Kokshetau, Petropavlosk, Zhezkazgan, Anadyr, Nyagan, Kirov, Kurgan, Termez, Cheboksary, Saransk, Hubli, Dimapur, Laamu Atoll, Haiphong, ...]  \n",
       "2                                                                                                                                                                                                                                                                                                                                                                                                                                          [Herat, Al-ahsa, El-baha, Bisha, Nejran, Abadan, Gwadar, Rahim Yar Khan, Kinmen, Makung, Memanbetsu, Asahikawa, Hanamaki, Miyako, Romblon, Zamboanga, Uralsk, Pavlodar, Semiplatinsk, Abakan, Bhopal, Agartala, Aizwal, Silchar, Chandigarh, Leh, Bagan, Ternate, Labuan, Banda Aceh, Kuantan, Pyongyang, Xichang, Kashi, Hodeidah, Dalat, Dipolog, Arkhangelsk, Saratov, Uromiyeh, Dera Ghazi Khan, Kushiro, Kostanay, Izhevsk, Andizhan, Khanabad, Pleiku, Bandar Lampung-Sumatra Island, Quzhou, Qiqihar, Dandong, Navoi, Wuzhou, Baise, Yongzhou, Anshun, Jinchuan]  "
      ]
     },
     "execution_count": 34,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"MATCH (a:Asia)\n",
    "RETURN a.Triangles_Asia AS Triangle_Communities, \n",
    "COUNT(DISTINCT a.Label) as Count, COLLECT(DISTINCT a.Label) as Airports\n",
    "ORDER BY Count DESC\n",
    "LIMIT 3;\n",
    "\"\"\"\n",
    "db.custom_query(query)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "d0bf7c68",
   "metadata": {},
   "source": [
    "#### <font color= #d04e4e> &nbsp; &nbsp; **Dijkstra en Asia** </font>"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 34,
   "id": "a0d4bf13",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Order</th>\n",
       "      <th>Distance</th>\n",
       "      <th>Full_route</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>(Guadalajara, Tokyo, Seoul, Beijing, Chongqing, Yangon, Bangkok, Singapore)</td>\n",
       "      <td>18617.800872</td>\n",
       "      <td>[Guadalajara, Los Angeles, Tokyo, Tokyo, Seoul, Seoul, Dalian, Chifeng, Beijing, Beijing, Chongqing, Chongqing, Kunming, Yangon, Yangon, Bangkok, Bangkok, Singapore, Singapore]</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                                                         Order  \\\n",
       "0  (Guadalajara, Tokyo, Seoul, Beijing, Chongqing, Yangon, Bangkok, Singapore)   \n",
       "\n",
       "       Distance  \\\n",
       "0  18617.800872   \n",
       "\n",
       "                                                                                                                                                                         Full_route  \n",
       "0  [Guadalajara, Los Angeles, Tokyo, Tokyo, Seoul, Seoul, Dalian, Chifeng, Beijing, Beijing, Chongqing, Chongqing, Kunming, Yangon, Yangon, Bangkok, Bangkok, Singapore, Singapore]  "
      ]
     },
     "execution_count": 34,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "db.find_best_route('Airport', 'Label', 'Guadalajara', ['Beijing', 'Chongqing', 'Tokyo', 'Singapore', 'Bangkok', 'Seoul', 'Yangon'], 'distance')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 35,
   "id": "3dc9115e",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Source</th>\n",
       "      <th>Target</th>\n",
       "      <th>Bridges</th>\n",
       "      <th>Distance</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Singapore</td>\n",
       "      <td>Guadalajara</td>\n",
       "      <td>[Singapore, Tokyo, Los Angeles, Guadalajara]</td>\n",
       "      <td>16235.260875</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "      Source       Target                                       Bridges  \\\n",
       "0  Singapore  Guadalajara  [Singapore, Tokyo, Los Angeles, Guadalajara]   \n",
       "\n",
       "       Distance  \n",
       "0  16235.260875  "
      ]
     },
     "execution_count": 35,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "db.temp_dijkstra_directed('Airport', 'Label', 'Singapore', 'Guadalajara', 'distance')"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "ec99415a",
   "metadata": {},
   "source": [
    "#### <font color= #d04e4e> &nbsp; &nbsp; **Ruta más económica** </font>"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 36,
   "id": "4ad33dba",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Order</th>\n",
       "      <th>Distance</th>\n",
       "      <th>Full_route</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>(Guadalajara, Tokyo, Seoul, Beijing)</td>\n",
       "      <td>13373.295402</td>\n",
       "      <td>[Guadalajara, Los Angeles, Tokyo, Tokyo, Seoul, Seoul, Dalian, Chifeng, Beijing, Beijing]</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                  Order      Distance  \\\n",
       "0  (Guadalajara, Tokyo, Seoul, Beijing)  13373.295402   \n",
       "\n",
       "                                                                                  Full_route  \n",
       "0  [Guadalajara, Los Angeles, Tokyo, Tokyo, Seoul, Seoul, Dalian, Chifeng, Beijing, Beijing]  "
      ]
     },
     "execution_count": 36,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "db.find_best_route('Airport', 'Label', 'Guadalajara', ['Beijing', 'Tokyo', 'Seoul'], 'distance')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 37,
   "id": "b1f608bc",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Source</th>\n",
       "      <th>Target</th>\n",
       "      <th>Bridges</th>\n",
       "      <th>Distance</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Beijing</td>\n",
       "      <td>Guadalajara</td>\n",
       "      <td>[Beijing, Seattle, Phoenix, Guadalajara]</td>\n",
       "      <td>12147.603112</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Beijing</td>\n",
       "      <td>Guadalajara</td>\n",
       "      <td>[Beijing, Chifeng, Shenyang, Vancouver, Phoenix, Guadalajara]</td>\n",
       "      <td>12399.258093</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "    Source       Target  \\\n",
       "0  Beijing  Guadalajara   \n",
       "1  Beijing  Guadalajara   \n",
       "\n",
       "                                                         Bridges      Distance  \n",
       "0                       [Beijing, Seattle, Phoenix, Guadalajara]  12147.603112  \n",
       "1  [Beijing, Chifeng, Shenyang, Vancouver, Phoenix, Guadalajara]  12399.258093  "
      ]
     },
     "execution_count": 37,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "db.temp_dijkstra_directed('Airport', 'Label', 'Beijing', 'Guadalajara', 'distance')"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "graph_mining",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.12.5"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
